{
    "time": {
        "If school starts at 8:15 AM and lasts 6 hours 45 minutes, what time does it end?": "3:00 PM",
        "What is 38 minutes past 9:57 PM?": "10:35 PM",
        "A movie starts at 6:30 PM and lasts 2 hours 50 minutes. What time does it finish?": "9:20 PM",
        "You leave your house at 7:40 AM for a drive to Costco. The drive lasts 55 minutes. When do you arrive?": "8:35 AM",
        "If breakfast is at 7:30 AM and lunch is 5 hours 15 minutes later, what time is lunch?": "12:45 PM",
        "A football match starts at 4:20 PM and lasts 1 hour 50 minutes. What time does it end?": "6:10 PM",
        "School starts at 9:00 AM. The first class begins immediately and lasts 1 hour 40 minutes. What time does the first class end?": "10:40 AM",
        "A train leaves at 5:45 PM and arrives 3 hours 20 minutes later. What time does it arrive?": "9:05 PM",
        "You start a video game session at 7:20 PM for 2 hours 25 minutes. When do you stop playing?": "9:45 PM",
        "You start cooking at 5:35 PM. The recipe takes 1 hour 50 minutes. When is dinner ready?": "7:25 PM",
        "If you start reading at 3:15 PM for 1 hour 50 minutes, when do you finish?": "5:05 PM",
        "School starts at 8:10 AM and ends at 3:05 PM. How long is the school day?": "6 hours 55 minutes",
        "A flight departs at 11:20 PM and takes 5 hours 30 minutes. When do you arrive? (Assume that departure point and arrival point are in the same time zone, arrival is next day)": "4:50 AM",
        "If a train leaves at 7:40 AM and arrives at 11:25 AM, how long is the trip?": "3 hours 45 minutes",
        "You start jogging at 6:15 AM for 55 minutes. When do you finish?": "7:10 AM",
        "School ends at 2:55 PM and a bus departs 25 minutes later for a 1 hour 50 minute trip to your house. When do you arrive home?": "5:10 PM",
        "A lecture starts at 10:40 AM and ends at 1:05 PM. How long did the lecture last?": "2 hours 25 minutes",
        "Dinner starts at 6:30 PM and lasts 1 hour 15 minutes. When do you finish?": "7:45 PM",
        "A movie starts at 4:10 PM and lasts 2 hours 35 minutes. When does it finish?": "6:45 PM",
        "A meeting begins at 11:35 AM and lasts 2 hours 20 minutes. When does it end?": "1:55 PM",
        "School ends at 3:50 PM. Practice starts 15 minutes later and lasts 1 hour 30 minutes. When does practice end?": "5:35 PM",
        "You start cooking at 4:40 PM. The recipe takes 2 hours 10 minutes. When is dinner ready?": "6:50 PM",
        "School starts at 8:05 AM and ends at 2:50 PM. How long is the school day?": "6 hours 45 minutes",
        "If you start jogging at 6:50 AM for 1 hour 20 minutes, when do you finish?": "8:10 AM",
        "A lecture starts at 10:25 AM and ends at 12:50 PM. How long was it?": "2 hours 25 minutes",
        "Dinner starts at 6:10 PM and lasts 1 hour 30 minutes. When do you finish?": "7:40 PM",
        "School ends at 3:15 PM. Practice starts 20 minutes later and lasts 1 hour 45 minutes. When does practice end?": "5:20 PM",
        "A bus departs at 7:05 AM and arrives at 9:40 AM. How long was the trip?": "2 hours 35 minutes",
        "School starts at 8:20 AM and ends at 2:55 PM. How long is the school day?": "6 hours 35 minutes",
        "If you start jogging at 6:35 AM for 1 hour 15 minutes, when do you finish?": "7:50 AM",
        "School ends at 2:35 PM. A bus departs 25 minutes later for a 1 hour 50 minute trip to your house. When do you get home?": "4:50 PM",
        "A lecture starts at 10:35 AM and ends at 1:00 PM. How long was the lecture?": "2 hours 25 minutes",
        "Dinner starts at 6:20 PM and lasts 1 hour 25 minutes. When do you finish?": "7:45 PM",
        "The train leaves at 5:20 PM and arrives 3 hours 50 minutes later. When does it arrive?": "9:10 PM",
        "School ends at 3:20 PM. Practice starts 15 minutes later and lasts 1 hour 30 minutes. When does practice end?": "5:05 PM",
        "You start cooking at 4:45 PM. The recipe takes 2 hours 5 minutes. When is dinner ready?": "6:50 PM",
        "A train departs at 8:10 AM and the train ride lasts 3 hours 35 minutes until arrival. When does it arrive?": "11:45 AM",
        "A bus departs at 7:15 AM and arrives at 9:50 AM. How long was the trip?": "2 hours 35 minutes",
        "School starts at 7:55 AM and lasts 5 hours 35 minutes. When does it end?": "1:30 PM",
        "A train leaves at 10:25 AM and travels for 2 hours 45 minutes to arrival. When does it arrive?": "1:10 PM",
        "You start reading at 6:40 PM and stop 1 hour 32 minutes later. When do you finish?": "8:12 PM",
        "A bus departs at 3:15 PM and arrives 1 hour 20 minutes later. When does it arrive?": "4:35 PM",
        "Lunch is at 12:20 PM. Dinner is 6 hours 10 minutes later. When is dinner?": "6:30 PM",
        "A class begins at 9:10 AM and lasts 2 hours 25 minutes. When does it end?": "11:35 AM",
        "A movie begins at 7:45 PM and runs for 2 hours 18 minutes. When does it finish?": "10:03 PM",
        "You leave work at 5:05 PM and drive home for 48 minutes. When do you arrive home?": "5:53 PM",
        "A meeting starts at 11:15 AM and lasts 1 hour 42 minutes. When does it end?": "12:57 PM",
        "A concert starts at 6:55 PM and lasts 3 hours 5 minutes. When does it end?": "10:00 PM",
        "Breakfast is at 8:25 AM. Snack is 4 hours 50 minutes later. When is the snack?": "1:15 PM",
        "You begin playing a game at 2:30 PM and stop 2 hours 47 minutes later. When do you finish?": "5:17 PM",
        "A lecture starts at 1:05 PM and lasts 95 minutes. When does it end?": "2:40 PM",
        "School ends at 3:25 PM. The after-school program lasts 2 hours 17 minutes. When does it end?": "5:42 PM",
        "A train departs at 2:15 PM and the ride lasts 3 hours 40 minutes to its final stop. When does it arrive?": "5:55 PM",
        "A meeting starts at 3:10 PM and lasts 2 hours 45 minutes. When does it end?": "5:55 PM",
        "You start homework at 4:50 PM and spend 1 hour 35 minutes on it. When do you finish?": "6:25 PM",
        "Buses come every 25 minutes. The first bus departs at 6:10 AM. When does the third bus depart?": "7:00 AM",
        "A show begins at 8:05 PM and lasts 1 hour 50 minutes. When does it end?": "9:55 PM",
        "School ends at 2:40 PM. A club meeting starts 20 minutes later and lasts 1 hour 15 minutes. When does it end?": "4:15 PM",
        "Your flight departs at 6:30 AM and takes 3 hours 45 minutes. When do you land? (Assume departure and arrival are in the same time zone)": "10:15 AM",
        "A concert begins at 6:45 PM and lasts 3 hours 10 minutes. When does it end?": "9:55 PM",
        "The bus leaves at 8:15 AM and arrives at your destination 2 hours 10 minutes later. When do you arrive?": "10:25 AM",
        "School ends at 3:05 PM. A tutoring session starts 30 minutes later and lasts 1 hour 20 minutes. When does it finish?": "4:55 PM",
        "A train departs at 9:50 AM and the ride lasts 4 hours 25 minutes. When does it arrive?": "2:15 PM",
        "Your meeting starts at 1:30 PM and lasts 2 hours 40 minutes. When does it end?": "4:10 PM",
        "A movie starts at 5:50 PM and lasts 2 hours 25 minutes. When does it finish?": "8:15 PM",
        "A class starts at 2:20 PM and lasts 1 hour 35 minutes. When does it end?": "3:55 PM",
        "The train leaves at 5:05 PM and travels for 3 hours 50 minutes to your stop. When do you arrive?": "8:55 PM",
        "School starts at 9:25 AM and lasts 6 hours 15 minutes. When does it end?": "3:40 PM",
        "You start a study session at 7:20 PM for 1 hour 45 minutes. When do you finish?": "9:05 PM",
        "A train departs at 8:05 AM and the ride takes 3 hours 40 minutes to go to your stop. When do you arrive?": "11:45 AM",
        "You leave at 9:30 AM for a 2 hour 25 minute drive. When do you arrive?": "11:55 AM",
        "A lecture starts at 1:50 PM and lasts 1 hour 55 minutes. When does it end?": "3:45 PM",
        "A movie starts at 6:40 PM and lasts 2 hours 15 minutes. When does it finish?": "8:55 PM",
        "You start studying at 5:25 PM for 2 hours 10 minutes. When do you stop?": "7:35 PM",
        "A flight leaves at 10:55 PM and takes 6 hours 15 minutes. When do you arrive? (Assume departure and arrival are in the same time zone, arrival is next day)": "5:10 AM",
        "A class starts at 3:15 PM and lasts 1 hour 50 minutes. When does it end?": "5:05 PM",
        "School ends at 2:45 PM. A bus departs 30 minutes later for a 1 hour 45 minute trip to your house. When do you arrive home?": "5:00 PM",
        "You start a movie at 3:35 PM and it lasts 2 hours 50 minutes. When does it end?": "6:25 PM",
        "The train leaves at 5:40 PM and rides for 3 hours 55 minutes to your stop. When do you arrive?": "9:35 PM",
        "School starts at 9:10 AM and lasts 6 hours 20 minutes. When does it end?": "3:30 PM",
        "A game show starts at 4:25 PM and lasts 2 hours 40 minutes. When does it finish?": "7:05 PM",
        "You start a study session at 7:10 PM for 1 hour 50 minutes. When do you finish?": "9:00 PM",
        "A meeting begins at 11:20 AM and lasts 2 hours 35 minutes. When does it end?": "1:55 PM",
        "You start cooking at 4:55 PM. The recipe takes 1 hour 55 minutes. When is dinner ready?": "6:50 PM",
        "A train departs at 8:25 AM and the ride takes 3 hours 45 minutes to go to your stop. When do you arrive?": "12:10 PM",
        "You leave at 9:15 AM for a 2 hour 35 minute drive. When do you arrive?": "11:50 AM",
        "A lecture starts at 1:40 PM and lasts 1 hour 50 minutes. When does it end?": "3:30 PM",
        "A movie starts at 6:25 PM and lasts 2 hours 30 minutes. When does it finish?": "8:55 PM",
        "You start studying at 5:10 PM for 2 hours 20 minutes. When do you stop?": "7:30 PM",
        "A flight leaves at 10:40 PM and takes 6 hours 20 minutes. When do you arrive? (Assume departure and arrival are in the same time zone, arrival is next day)": "5:00 AM",
        "A class starts at 3:05 PM and lasts 1 hour 40 minutes. When does it end?": "4:45 PM",
        "You start a movie at 3:50 PM and it lasts 2 hours 40 minutes. When does it end?": "6:30 PM",
        "School starts at 9:05 AM and lasts 6 hours 15 minutes. When does it end?": "3:20 PM",
        "A game starts at 4:15 PM and lasts 2 hours 30 minutes. When does it finish?": "6:45 PM",
        "You start a study session at 7:05 PM for 1 hour 45 minutes. When do you finish?": "8:50 PM",
        "A meeting begins at 11:10 AM and lasts 2 hours 20 minutes. When does it end?": "1:30 PM",
        "You leave at 9:25 AM for a 2 hour 40 minute drive. When do you arrive?": "12:05 PM",
        "A lecture starts at 1:50 PM and lasts 1 hour 45 minutes. When does it end?": "3:35 PM",
        "The flight leaves at 8:40 AM and lasts 5 hours 20 minutes. When you arrive? (Assume departure and arrival are in the same time zone)": "2:00 PM",
        "A bus leaves at 11:25 AM and arrives 2 hours 35 minutes later. When does it arrive?": "2:00 PM",
        "School starts at 8:30 AM and lasts 6 hours 10 minutes. When does it end?": "2:40 PM",
        "School ends at 3:05 PM. A tutoring session starts 25 minutes later and lasts 1 hour 15 minutes. When does it finish?": "4:45 PM",
        "A train departs at 6:45 AM and arrives 3 hours 25 minutes later. When does it arrive?": "10:10 AM",
        "Breakfast starts at 7:50 AM and lasts 35 minutes. When do you finish eating?": "8:25 AM",
        "Lunch begins at 12:40 PM and lasts 50 minutes. When is lunch over?": "1:30 PM",
        "Dinner starts at 6:15 PM and lasts 1 hour 20 minutes. When does dinner end?": "7:35 PM",
        "School starts at 9:10 AM and ends at 3:00 PM. How long is the school day?": "5 hours 50 minutes",
        "You begin studying at 4:25 PM for 1 hour 40 minutes. When do you finish?": "6:05 PM",
        "School ends at 2:55 PM. Practice starts 20 minutes later and lasts 1 hour 35 minutes. When does practice end?": "4:50 PM",
        "A bus leaves at 7:20 AM and arrives 2 hours 15 minutes later. When do you arrive?": "9:35 AM",
        "You eat breakfast at 7:30 AM for 25 minutes. When do you finish breakfast?": "7:55 AM",
        "Lunch is at 1:10 PM. Dinner is 5 hours 5 minutes later. When is dinner?": "6:15 PM",
        "You eat a snack at 3:40 PM and it lasts 20 minutes. When are you done snacking?": "4:00 PM",
        "School starts at 7:55 AM and lasts 7 hours 5 minutes. When does it end?": "3:00 PM",
        "School ends at 2:40 PM. The after-school program lasts 1 hour 55 minutes. When does it finish?": "4:35 PM",
        "A lecture starts at 9:20 AM and ends at 11:10 AM. How long was the lecture?": "1 hour 50 minutes",
        "A train leaves at 4:55 PM and arrives 4 hours 5 minutes later. What time does it arrive?": "9:00 PM",
        "You eat dinner at 6:25 PM for 1 hour 10 minutes. When do you finish dinner?": "7:35 PM",
        "Breakfast is at 8:00 AM. Lunch is 4 hours 45 minutes later. When is lunch?": "12:45 PM",
        "School starts at 8:40 AM and ends at 3:15 PM. How long is the school day?": "6 hours 35 minutes",
        "School ends at 2:35 PM. A club meeting begins 30 minutes later and lasts 1 hour 25 minutes. When does it finish?": "4:30 PM",
        "You eat lunch at 12:30 PM for 45 minutes. When do you finish eating?": "1:15 PM",
        "A bus departs at 6:30 AM and arrives 3 hours 10 minutes later. When does it arrive?": "9:40 AM",
        "Dinner begins at 5:50 PM and lasts 1 hour 35 minutes. When do you finish dinner?": "7:25 PM",
        "School starts at 8:20 AM and lasts 6 hours 20 minutes. When does it end?": "2:40 PM",
        "School ends at 3:25 PM. Practice begins 15 minutes later and lasts 2 hours 5 minutes. When does practice end?": "5:45 PM",
        "Breakfast starts at 6:55 AM and lasts 40 minutes. When do you finish breakfast?": "7:35 AM",
        "Lunch begins at 1:00 PM. Dinner is 5 hours 30 minutes later. When is dinner?": "6:30 PM",
        "A train departs at 2:15 PM and rides for 2 hours 50 minutes. When does it arrive?": "5:05 PM",
        "You begin reading at 4:50 PM for 1 hour 15 minutes. When do you finish?": "6:05 PM",
        "School starts at 9:00 AM and lasts 6 hours 5 minutes. When does it end?": "3:05 PM",
        "School ends at 2:50 PM. A bus leaves 25 minutes later for a 1 hour 40 minute trip. When do you get home?": "4:55 PM",
        "Dinner begins at 6:05 PM and lasts 1 hour 25 minutes. When do you finish?": "7:30 PM",
        "Breakfast is at 8:15 AM. Lunch is 4 hours 35 minutes later. When is lunch?": "12:50 PM",
        "A lecture starts at 10:45 AM and ends at 12:15 PM. How long was the lecture?": "1 hour 30 minutes",
        "A bus departs at 3:05 PM and arrives 2 hours 15 minutes later. When do you arrive?": "5:20 PM",
        "School ends at 3:20 PM. The after-school program lasts 2 hours 10 minutes. When does it finish?": "5:30 PM",
        "You eat lunch at 12:45 PM for 35 minutes. When do you finish lunch?": "1:20 PM",
        "Dinner begins at 6:40 PM and lasts 1 hour 5 minutes. When do you finish?": "7:45 PM",
        "A train departs at 7:05 AM and travels for 2 hours 35 minutes. When does it arrive?": "9:40 AM",
        "School starts at 9:15 AM and lasts 6 hours 25 minutes. When does it end?": "3:40 PM",
        "School ends at 2:55 PM. Practice begins 25 minutes later and lasts 1 hour 20 minutes. When does practice end?": "4:40 PM",
        "Breakfast starts at 7:05 AM and lasts 30 minutes. When do you finish?": "7:35 AM",
        "Lunch begins at 12:35 PM. Dinner is 6 hours 5 minutes later. When is dinner?": "6:40 PM",
        "You eat a snack at 3:15 PM and it lasts 25 minutes. When do you finish snacking?": "3:40 PM",
        "School starts at 8:25 AM and ends at 3:00 PM. How long is the school day?": "6 hours 35 minutes",
        "School ends at 3:10 PM. A club meeting begins 15 minutes later and lasts 1 hour 40 minutes. When does it finish?": "5:05 PM",
        "A train departs at 4:20 PM and travels for 3 hours 15 minutes. When does it arrive?": "7:35 PM",
        "Dinner begins at 5:30 PM and lasts 1 hour 50 minutes. When do you finish?": "7:20 PM",
        "Breakfast is at 7:10 AM. Lunch is 5 hours 20 minutes later. When is lunch?": "12:30 PM",
        "School starts at 8:50 AM and lasts 6 hours 15 minutes. When does it end?": "3:05 PM",
        "School ends at 2:45 PM. Practice starts 35 minutes later and lasts 1 hour 25 minutes. When does practice end?": "4:45 PM",
        "A bus departs at 6:40 AM and arrives 2 hours 55 minutes later. When do you arrive?": "9:35 AM",
        "You eat lunch at 1:05 PM for 40 minutes. When do you finish eating?": "1:45 PM",
        "Dinner begins at 6:50 PM and lasts 1 hour 10 minutes. When do you finish?": "8:00 PM",
        "School starts at 8:35 AM and ends at 3:10 PM. How long is the school day?": "6 hours 35 minutes",
        "School ends at 3:30 PM. The after-school program lasts 2 hours 5 minutes. When does it end?": "5:35 PM",
        "Breakfast starts at 6:45 AM and lasts 25 minutes. When do you finish?": "7:10 AM",
        "Lunch begins at 12:25 PM. Dinner is 6 hours 15 minutes later. When is dinner?": "6:40 PM",
        "You eat a snack at 4:05 PM and it lasts 30 minutes. When do you finish?": "4:35 PM",
        "A train departs at 9:10 AM and rides for 4 hours 20 minutes. When does it arrive?": "1:30 PM",
        "School starts at 9:05 AM and lasts 6 hours 10 minutes. When does it end?": "3:15 PM",
        "School ends at 3:40 PM. A club meeting begins 20 minutes later and lasts 1 hour 50 minutes. When does it finish?": "5:50 PM",
        "Dinner begins at 6:35 PM and lasts 1 hour 25 minutes. When do you finish dinner?": "8:00 PM",
        "Breakfast is at 7:35 AM. Lunch is 4 hours 50 minutes later. When is lunch?": "12:25 PM",
        "School starts at 8:15 AM and lasts 6 hours 30 minutes. When does it end?": "2:45 PM",
        "School ends at 2:50 PM. Practice begins 30 minutes later and lasts 1 hour 35 minutes. When does practice end?": "4:55 PM",
        "A bus departs at 5:55 AM and arrives 3 hours 25 minutes later. When do you arrive?": "9:20 AM",
        "You eat lunch at 1:25 PM for 35 minutes. When do you finish eating?": "2:00 PM",
        "Dinner begins at 5:55 PM and lasts 1 hour 30 minutes. When do you finish?": "7:25 PM",
        "Breakfast starts at 8:20 AM and lasts 20 minutes. When do you finish breakfast?": "8:40 AM",
        "Lunch begins at 12:50 PM. Dinner is 5 hours 40 minutes later. When is dinner?": "6:30 PM",
        "School starts at 9:25 AM and ends at 3:30 PM. How long is the school day?": "6 hours 5 minutes",
        "School ends at 2:35 PM. A tutoring session begins 25 minutes later and lasts 1 hour 50 minutes. When does it finish?": "4:50 PM",
        "A train leaves at 7:55 AM and arrives 3 hours 40 minutes later. When does it arrive?": "11:35 AM",
        "Dinner begins at 6:10 PM and lasts 1 hour 40 minutes. When do you finish?": "7:50 PM",
        "Breakfast is at 7:25 AM. Lunch is 5 hours 15 minutes later. When is lunch?": "12:40 PM",
        "You eat a snack at 3:55 PM and it lasts 25 minutes. When do you finish?": "4:20 PM",
        "School starts at 8:00 AM and lasts 7 hours 5 minutes. When does it end?": "3:05 PM",
        "School ends at 3:15 PM. Practice begins 20 minutes later and lasts 1 hour 45 minutes. When does practice end?": "5:20 PM",
        "Breakfast starts at 6:35 AM and lasts 35 minutes. When do you finish?": "7:10 AM",
        "Lunch begins at 12:15 PM. Dinner is 6 hours 25 minutes later. When is dinner?": "6:40 PM",
        "A bus departs at 6:50 AM and arrives 2 hours 30 minutes later. When do you arrive?": "9:20 AM",
        "You eat lunch at 1:40 PM for 30 minutes. When do you finish?": "2:10 PM",
        "Dinner begins at 7:05 PM and lasts 1 hour 15 minutes. When do you finish?": "8:20 PM",
        "School starts at 8:45 AM and lasts 6 hours 10 minutes. When does it end?": "2:55 PM",
        "School ends at 2:25 PM. A club meeting starts 25 minutes later and lasts 1 hour 30 minutes. When does it finish?": "3:50 PM",
        "A train departs at 10:20 AM and rides for 2 hours 40 minutes. When does it arrive?": "1:00 PM",
        "Dinner begins at 5:45 PM and lasts 1 hour 20 minutes. When do you finish?": "7:05 PM",
        "Breakfast starts at 7:15 AM and lasts 28 minutes. When do you finish?": "7:43 AM",
        "Lunch begins at 12:05 PM and lasts 42 minutes. When do you finish?": "12:47 PM",
        "Dinner is at 6:55 PM. Dessert is 45 minutes later. When is dessert?": "7:40 PM",
        "School starts at 9:35 AM and lasts 5 hours 55 minutes. When does it end?": "3:30 PM",
        "School ends at 2:20 PM. A bus departs 15 minutes later and the ride lasts 1 hour 25 minutes. When do you get home?": "4:00 PM",
        "A lecture starts at 11:10 AM and ends at 12:35 PM. How long did it last?": "1 hour 25 minutes",
        "A train leaves at 6:25 PM and travels 2 hours 45 minutes. When does it arrive?": "9:10 PM",
        "You start a snack at 4:25 PM for 18 minutes. When do you finish?": "4:43 PM",
        "Breakfast is at 7:00 AM. Lunch is 5 hours 10 minutes later. When is lunch?": "12:10 PM",
        "School starts at 8:10 AM and lasts 6 hours 35 minutes. When does it end?": "2:45 PM",
        "School ends at 3:45 PM. A club meeting starts 25 minutes later and lasts 1 hour 35 minutes. When does it finish?": "5:45 PM",
        "School starts at 8:25 AM and lasts 6 hours 20 minutes. When does it end?": "2:45 PM",
        "School ends at 3:00 PM. Practice starts 20 minutes later and lasts 1 hour 40 minutes. When does it end?": "5:00 PM",
        "A train leaves at 7:30 AM and rides for 2 hours 50 minutes. When does it arrive?": "10:20 AM",
        "Lunch begins at 12:55 PM and lasts 35 minutes. When do you finish?": "1:30 PM",
        "Dinner starts at 6:35 PM and lasts 1 hour 25 minutes. When do you finish?": "8:00 PM",
        "School starts at 9:05 AM and ends at 2:50 PM. How long is the school day?": "5 hours 45 minutes",
        "School ends at 3:35 PM. A club meeting begins 15 minutes later and lasts 1 hour 30 minutes. When does it end?": "5:20 PM",
        "A bus departs at 6:55 AM and arrives 3 hours 15 minutes later. When does it arrive?": "10:10 AM",
        "Breakfast is at 8:20 AM. Lunch is 4 hours 40 minutes later. When is lunch?": "1:00 PM",
        "You eat lunch at 12:35 PM for 40 minutes. When do you finish?": "1:15 PM",
        "Dinner begins at 6:45 PM and lasts 1 hour 10 minutes. When do you finish?": "7:55 PM",
        "School starts at 8:50 AM and lasts 6 hours 5 minutes. When does it end?": "2:55 PM",
        "School ends at 2:40 PM. The after-school program lasts 2 hours 20 minutes. When does it finish?": "5:00 PM",
        "A lecture starts at 10:55 AM and ends at 12:25 PM. How long was it?": "1 hour 30 minutes",
        "A train departs at 4:10 PM and travels for 3 hours 25 minutes. When does it arrive?": "7:35 PM",
        "Breakfast starts at 7:40 AM and lasts 30 minutes. When do you finish?": "8:10 AM",
        "Lunch is at 12:25 PM. Dinner is 5 hours 50 minutes later. When is dinner?": "6:15 PM",
        "You eat a snack at 3:10 PM for 20 minutes. When do you finish?": "3:30 PM",
        "School starts at 9:15 AM and lasts 6 hours 10 minutes. When does it end?": "3:25 PM",
        "School ends at 3:20 PM. Practice starts 20 minutes later and lasts 1 hour 25 minutes. When does it finish?": "5:05 PM",
        "A bus departs at 7:15 AM and arrives 2 hours 55 minutes later. When does it arrive?": "10:10 AM",
        "Dinner begins at 5:55 PM and lasts 1 hour 35 minutes. When do you finish?": "7:30 PM",
        "Breakfast is at 7:05 AM. Lunch is 5 hours 15 minutes later. When is lunch?": "12:20 PM",
        "You eat lunch at 1:20 PM for 30 minutes. When do you finish?": "1:50 PM",
        "School ends at 2:50 PM. A bus leaves 25 minutes later for a 1 hour 50 minute trip. When do you arrive home?": "5:05 PM",
        "A lecture starts at 9:45 AM and ends at 11:30 AM. How long did it last?": "1 hour 45 minutes",
        "A train leaves at 8:55 AM and arrives 3 hours 35 minutes later. When does it arrive?": "12:30 PM",
        "Breakfast starts at 7:25 AM and lasts 40 minutes. When do you finish?": "8:05 AM",
        "Lunch begins at 1:15 PM. Dinner is 5 hours 25 minutes later. When is dinner?": "6:40 PM",
        "Dinner begins at 6:20 PM and lasts 1 hour 15 minutes. When do you finish?": "7:35 PM",
        "School starts at 9:20 AM and lasts 6 hours 25 minutes. When does it end?": "3:45 PM",
        "School ends at 3:05 PM. A club meeting begins 30 minutes later and lasts 1 hour 20 minutes. When does it end?": "4:55 PM",
        "You eat lunch at 12:50 PM for 35 minutes. When do you finish?": "1:25 PM",
        "Breakfast is at 8:10 AM. Lunch is 4 hours 50 minutes later. When is lunch?": "1:00 PM",
        "A bus departs at 5:50 AM and arrives 3 hours 10 minutes later. When does it arrive?": "9:00 AM",
        "Dinner begins at 7:00 PM and lasts 1 hour 20 minutes. When do you finish?": "8:20 PM",
        "School starts at 8:15 AM and lasts 6 hours 40 minutes. When does it end?": "2:55 PM",
        "School ends at 2:30 PM. Practice starts 40 minutes later and lasts 1 hour 25 minutes. When does it finish?": "4:35 PM",
        "A train departs at 6:20 AM and arrives 2 hours 55 minutes later. When does it arrive?": "9:15 AM",
        "Breakfast starts at 6:55 AM and lasts 30 minutes. When do you finish?": "7:25 AM",
        "Lunch begins at 12:45 PM and lasts 40 minutes. When do you finish?": "1:25 PM",
        "Dinner starts at 5:40 PM and lasts 1 hour 50 minutes. When do you finish?": "7:30 PM",
        "School starts at 8:55 AM and ends at 3:05 PM. How long is the school day?": "6 hours 10 minutes",
        "School ends at 3:15 PM. The after-school program lasts 2 hours 5 minutes. When does it finish?": "5:20 PM",
        "Breakfast is at 7:45 AM. Lunch is 4 hours 55 minutes later. When is lunch?": "12:40 PM",
        "You eat lunch at 1:30 PM for 45 minutes. When do you finish?": "2:15 PM",
        "Dinner begins at 6:10 PM and lasts 1 hour 30 minutes. When do you finish?": "7:40 PM",
        "A lecture starts at 11:00 AM and ends at 12:20 PM. How long was it?": "1 hour 20 minutes",
        "A train departs at 3:15 PM and rides for 3 hours 20 minutes. When does it arrive?": "6:35 PM",
        "School starts at 9:30 AM and lasts 6 hours 10 minutes. When does it end?": "3:40 PM",
        "School ends at 2:55 PM. Practice starts 25 minutes later and lasts 1 hour 35 minutes. When does it end?": "4:55 PM",
        "Breakfast starts at 7:20 AM and lasts 25 minutes. When do you finish?": "7:45 AM",
        "Lunch begins at 12:20 PM. Dinner is 6 hours 15 minutes later. When is dinner?": "6:35 PM",
        "Dinner begins at 6:25 PM and lasts 1 hour 25 minutes. When do you finish?": "7:50 PM",
        "A bus departs at 7:10 AM and arrives 2 hours 50 minutes later. When does it arrive?": "10:00 AM",
        "School ends at 3:25 PM. A club meeting begins 20 minutes later and lasts 1 hour 50 minutes. When does it end?": "5:35 PM",
        "Breakfast is at 7:35 AM. Lunch is 5 hours 10 minutes later. When is lunch?": "12:45 PM",
        "You eat lunch at 1:05 PM for 30 minutes. When do you finish?": "1:35 PM",
        "Dinner begins at 5:50 PM and lasts 1 hour 40 minutes. When do you finish?": "7:30 PM",
        "A train leaves at 9:25 AM and arrives 3 hours 15 minutes later. When does it arrive?": "12:40 PM",
        "School starts at 9:00 AM and lasts 6 hours 15 minutes. When does it end?": "3:15 PM",
        "School ends at 3:40 PM. Practice begins 30 minutes later and lasts 1 hour 45 minutes. When does it finish?": "5:55 PM",
        "Breakfast starts at 8:05 AM and lasts 35 minutes. When do you finish?": "8:40 AM",
        "Lunch begins at 12:30 PM and lasts 30 minutes. When do you finish?": "1:00 PM",
        "Dinner starts at 6:55 PM and lasts 1 hour 15 minutes. When do you finish?": "8:10 PM",
        "A bus departs at 6:25 AM and arrives 2 hours 40 minutes later. When does it arrive?": "9:05 AM",
        "School starts at 8:10 AM and ends at 2:55 PM. How long is the school day?": "6 hours 45 minutes",
        "School ends at 2:45 PM. The after-school program lasts 2 hours 25 minutes. When does it finish?": "5:10 PM",
        "Breakfast is at 6:50 AM. Lunch is 5 hours 30 minutes later. When is lunch?": "12:20 PM",
        "You eat lunch at 1:40 PM for 40 minutes. When do you finish?": "2:20 PM",
        "Dinner begins at 6:30 PM and lasts 1 hour 35 minutes. When do you finish?": "8:05 PM",
        "A lecture starts at 9:35 AM and ends at 11:25 AM. How long was it?": "1 hour 50 minutes",
        "A train departs at 2:50 PM and rides for 3 hours 5 minutes. When does it arrive?": "5:55 PM",
        "School starts at 9:10 AM and lasts 6 hours 5 minutes. When does it end?": "3:15 PM",
        "School ends at 3:10 PM. Practice begins 15 minutes later and lasts 1 hour 20 minutes. When does it finish?": "4:45 PM",
        "Breakfast starts at 7:50 AM and lasts 20 minutes. When do you finish?": "8:10 AM",
        "Lunch begins at 12:40 PM. Dinner is 6 hours later. When is dinner?": "6:40 PM",
        "Dinner begins at 7:15 PM and lasts 1 hour 20 minutes. When do you finish?": "8:35 PM",
        "A bus departs at 7:35 AM and arrives 3 hours 10 minutes later. When does it arrive?": "10:45 AM",
        "School starts at 8:30 AM and ends at 2:50 PM. How long is the school day?": "6 hours 20 minutes",
        "School ends at 2:35 PM. A club meeting begins 30 minutes later and lasts 1 hour 30 minutes. When does it finish?": "4:35 PM",
        "Breakfast is at 7:25 AM. Lunch is 4 hours 55 minutes later. When is lunch?": "12:20 PM",
        "You eat lunch at 12:15 PM for 35 minutes. When do you finish?": "12:50 PM",
        "A train departs at 5:35 PM and rides for 2 hours 45 minutes. When does it arrive?": "8:20 PM",
        "School starts at 8:05 AM and lasts 6 hours 30 minutes. When does it end?": "2:35 PM",
        "School ends at 2:20 PM. Practice begins 40 minutes later and lasts 1 hour 40 minutes. When does it finish?": "4:40 PM",
        "Breakfast starts at 6:40 AM and lasts 35 minutes. When do you finish?": "7:15 AM",
        "Lunch begins at 1:00 PM. Dinner is 5 hours 20 minutes later. When is dinner?": "6:20 PM",
        "Dinner begins at 5:35 PM and lasts 1 hour 45 minutes. When do you finish?": "7:20 PM",
        "A train departs at 5:20 PM and the journey is 2 hours 25 minutes. When does it arrive?": "7:45 PM",
        "The train arrives at 9:10 AM. If it departed 1 hour 50 minutes earlier, when did it leave?": "7:20 AM",
        "You board a train at 3:15 PM for a ride lasting 55 minutes. When do you get off?": "4:10 PM",
        "School begins at 8:55 AM and runs 6 hours 20 minutes. When does it end?": "3:15 PM",
        "A test starts at 1:25 PM and ends at 2:40 PM. How long was it?": "1 hour 15 minutes",
        "School ends at 2:05 PM. A bus leaves 30 minutes later and the ride takes 1 hour 5 minutes. When do you arrive home?": "3:40 PM",
        "School starts at 9:05 AM and lasts 7 hours 10 minutes. When does it end?": "4:15 PM",
        "Breakfast is at 6:40 AM. Lunch is 5 hours 45 minutes later. When is lunch?": "12:25 PM",
        "Dinner begins at 7:05 PM and lasts 1 hour 5 minutes. When does it end?": "8:10 PM",
        "You begin a snack at 3:45 PM that lasts 20 minutes. When do you finish?": "4:05 PM",
        "Lunch starts at 12:35 PM and ends at 1:20 PM. How long was lunch?": "45 minutes",
        "A train leaves at 7:25 AM and the ride is 2 hours 15 minutes. When does it arrive?": "9:40 AM",
        "A train departs at 4:10 PM and arrives 1 hour 55 minutes later. When does it arrive?": "6:05 PM",
        "The train arrives at 11:30 PM. If the journey was 3 hours 20 minutes, when did it depart?": "8:10 PM",
        "You board a train at 2:05 PM for a 45-minute ride. When do you get off?": "2:50 PM",
        "A train departs at 9:15 AM and arrives at 12:05 PM. How long was the journey?": "2 hours 50 minutes",
        "The train leaves at 6:25 PM and arrives at 9:50 PM. How long is the ride?": "3 hours 25 minutes",
        "You catch a train at 1:55 PM. After 1 hour 5 minutes you reach your stop. What time is it?": "3:00 PM",
        "A train leaves at 10:45 AM and arrives at 12:15 PM. How long did it travel?": "1 hour 30 minutes",
        "The train ride takes 4 hours 10 minutes and ends at 6:30 PM. When did it start?": "2:20 PM",
        "You get on the train at 7:40 AM and arrive at 10:25 AM. How long was the trip?": "2 hours 45 minutes",
        "A train departs at 5:05 PM and runs 2 hours 40 minutes. When does it arrive?": "7:45 PM",
        "The train leaves at 8:35 AM and you arrive 3 hours 5 minutes later. When do you arrive?": "11:40 AM",
        "School starts at 8:05 AM and lasts 6 hours 40 minutes. When does it end?": "2:45 PM",
        "A math class starts at 11:20 AM and ends at 12:15 PM. How long is class?": "55 minutes",
        "School ends at 3:05 PM. A bus leaves 20 minutes later and takes 1 hour 10 minutes. When do you get home?": "4:35 PM",
        "You begin school at 9:15 AM and finish at 3:45 PM. How long is the school day?": "6 hours 30 minutes",
        "A history test begins at 2:05 PM and lasts 1 hour 25 minutes. When does it end?": "3:30 PM",
        "School starts at 8:50 AM and runs 7 hours 5 minutes. When does it finish?": "3:55 PM",
        "School ends at 2:40 PM. Sports practice begins 15 minutes later and runs 1 hour 50 minutes. When does it end?": "4:45 PM",
        "A lecture starts at 10:25 AM and ends at 12:05 PM. How long did it last?": "1 hour 40 minutes",
        "School begins at 9:05 AM and ends 6 hours 55 minutes later. When is dismissal?": "4:00 PM",
        "A quiz runs from 1:15 PM to 2:00 PM. How long did it last?": "45 minutes",
        "School starts at 8:30 AM and ends at 3:20 PM. How many hours is that?": "6 hours 50 minutes",
        "School ends at 3:35 PM. A club meeting begins 40 minutes later and lasts 1 hour 15 minutes. When is it over?": "5:30 PM",
        "You arrive at school at 8:10 AM. Class begins 25 minutes later. What time is class?": "8:35 AM",
        "A science lesson starts at 10:15 AM and lasts 55 minutes. When does it end?": "11:10 AM",
        "School runs from 9:25 AM to 2:55 PM. How long is the day?": "5 hours 30 minutes",
        "The school play begins at 6:30 PM and ends at 8:05 PM. How long did it last?": "1 hour 35 minutes",
        "School starts at 8:45 AM and lasts 6 hours 30 minutes. When does it end?": "3:15 PM",
        "The bus picks up at 7:40 AM. School begins 30 minutes later. What time does school start?": "8:10 AM",
        "School ends at 2:55 PM. Homework takes 1 hour 15 minutes. When do you finish?": "4:10 PM",
        "You begin school at 9:35 AM. Dismissal is 6 hours 25 minutes later. When do you leave?": "4:00 PM",
        "A class starts at 11:10 AM and lasts 35 minutes. When does it finish?": "11:45 AM",
        "School runs from 8:25 AM until 3:05 PM. How long is that?": "6 hours 40 minutes",
        "The exam begins at 9:05 AM and ends at 10:55 AM. How long was it?": "1 hour 50 minutes",
        "School begins at 8:20 AM and ends at 2:50 PM. How long is the school day?": "6 hours 30 minutes",
        "A club meeting starts at 4:10 PM and runs 50 minutes. When is it done?": "5:00 PM",
        "School ends at 3:25 PM. The bus leaves 20 minutes later and the ride is 45 minutes. When do you get home?": "4:30 PM",
        "You start school at 9:00 AM. Lunch break is 3 hours 25 minutes later. What time is lunch?": "12:25 PM",
        "School begins at 8:55 AM and lasts 7 hours 5 minutes. When does it end?": "4:00 PM",
        "A music class runs from 1:30 PM to 2:20 PM. How long was it?": "50 minutes",
        "School starts at 8:15 AM and ends at 2:55 PM. How long is the day?": "6 hours 40 minutes",
        "Dismissal is at 3:40 PM. If school lasted 6 hours 35 minutes, when did it start?": "9:05 AM",
        "School begins at 9:10 AM and ends at 3:30 PM. How long is the day?": "6 hours 20 minutes",
        "School ends at 2:45 PM. Tutoring starts 15 minutes later and goes 1 hour 25 minutes. When does it finish?": "4:25 PM",
        "You start a test at 10:25 AM and finish at 11:55 AM. How long did it last?": "1 hour 30 minutes",
        "School begins at 8:05 AM and runs until 2:50 PM. How long is the day?": "6 hours 45 minutes",
        "The school day ends at 3:15 PM. If it lasted 6 hours 40 minutes, when did it start?": "8:35 AM",
        "School starts at 9:25 AM and lasts 6 hours 20 minutes. When is dismissal?": "3:45 PM",
        "A class begins at 11:05 AM and ends at 11:50 AM. How long is the class?": "45 minutes",
        "Breakfast is at 7:05 AM and lasts 25 minutes. When does it end?": "7:30 AM",
        "You start lunch at 12:15 PM and finish 35 minutes later. What time is it?": "12:50 PM",
        "Dinner begins at 6:40 PM and lasts 55 minutes. When is it over?": "7:35 PM",
        "Breakfast is at 7:20 AM. Lunch is 5 hours 30 minutes later. When is lunch?": "12:50 PM",
        "You begin a snack at 3:30 PM and finish 20 minutes later. What time is it?": "3:50 PM",
        "Dinner starts at 7:10 PM and ends at 8:00 PM. How long did it last?": "50 minutes",
        "Breakfast is at 6:55 AM. Lunch is 6 hours 5 minutes later. What time is lunch?": "1:00 PM",
        "You start eating at 1:05 PM and finish at 1:40 PM. How long did you eat?": "35 minutes",
        "Supper starts at 8:05 PM and lasts 40 minutes. When is it done?": "8:45 PM",
        "You eat breakfast at 7:35 AM. A snack is 2 hours 20 minutes later. When is snack?": "9:55 AM",
        "Lunch begins at 12:10 PM and lasts 30 minutes. When does it end?": "12:40 PM",
        "Dinner starts at 6:30 PM and goes until 7:25 PM. How long did it last?": "55 minutes",
        "Breakfast begins at 7:15 AM and lasts 40 minutes. When does it finish?": "7:55 AM",
        "You start lunch at 12:45 PM. It lasts 25 minutes. When does it end?": "1:10 PM",
        "Supper is at 7:50 PM. Dessert is 35 minutes later. What time is dessert?": "8:25 PM",
        "Breakfast begins at 6:50 AM. Lunch is 5 hours 20 minutes later. When is lunch?": "12:10 PM",
        "Dinner begins at 7:25 PM and ends 1 hour 5 minutes later. When does it end?": "8:30 PM",
        "You eat a snack at 4:10 PM and finish at 4:30 PM. How long did you snack?": "20 minutes",
        "Lunch starts at 12:05 PM and lasts 50 minutes. When does it finish?": "12:55 PM",
        "You start breakfast at 6:35 AM and finish 30 minutes later. When is it done?": "7:05 AM",
        "Dinner begins at 6:20 PM and lasts 1 hour 15 minutes. When does it finish?": "7:35 PM",
        "Breakfast starts at 7:10 AM. Lunch follows 5 hours later. What time is lunch?": "12:10 PM",
        "You begin a snack at 3:50 PM and eat for 25 minutes. When do you finish?": "4:15 PM",
        "Dinner starts at 6:55 PM and lasts 35 minutes. When is it over?": "7:30 PM",
        "Breakfast is at 7:25 AM and lasts 20 minutes. When does it end?": "7:45 AM",
        "Lunch begins at 12:20 PM and runs 40 minutes. When does it finish?": "1:00 PM",
        "Dinner starts at 6:15 PM and ends at 7:00 PM. How long is dinner?": "45 minutes",
        "Breakfast starts at 6:45 AM and lasts 35 minutes. When does it end?": "7:20 AM",
        "You begin lunch at 12:55 PM and finish at 1:35 PM. How long was lunch?": "40 minutes",
        "Dinner begins at 7:35 PM and lasts 50 minutes. When does it end?": "8:25 PM",
        "Breakfast is at 7:00 AM. A snack follows 2 hours 45 minutes later. What time is the snack?": "9:45 AM",
        "You start lunch at 12:25 PM and finish 30 minutes later. When is it done?": "12:55 PM",
        "Dinner begins at 6:35 PM and lasts 55 minutes. When does it end?": "7:30 PM",
        "Breakfast begins at 6:55 AM and ends at 7:25 AM. How long is breakfast?": "30 minutes",
        "You eat lunch at 12:15 PM and finish at 12:55 PM. How long did you eat?": "40 minutes",
        "Dinner starts at 7:05 PM and goes until 7:50 PM. How long was it?": "45 minutes",
        "Breakfast begins at 7:30 AM and lasts 25 minutes. When does it end?": "7:55 AM",
        "Lunch begins at 12:40 PM and lasts 35 minutes. When does it finish?": "1:15 PM",
        "Dinner starts at 6:45 PM and lasts 1 hour. When is it done?": "7:45 PM",
        "Breakfast begins at 6:40 AM and ends at 7:10 AM. How long did you eat?": "30 minutes",
        "Lunch is at 12:50 PM and goes 45 minutes. When does it finish?": "1:35 PM",
        "Dinner begins at 7:15 PM and ends 55 minutes later. When does it finish?": "8:10 PM",
        "Breakfast starts at 7:20 AM and lasts 20 minutes. When is it over?": "7:40 AM",
        "Lunch begins at 12:35 PM and lasts 30 minutes. When does it end?": "1:05 PM",
        "Dinner starts at 6:25 PM and lasts 1 hour 5 minutes. When does it end?": "7:30 PM",
        "A train leaves at 6:05 PM and the trip takes 1 hour 55 minutes. When does it arrive?": "8:00 PM",
        "School begins at 9:20 AM and runs 6 hours 10 minutes. When does it finish?": "3:30 PM",
        "School ends at 2:35 PM. You stay for a club lasting 50 minutes. When do you leave?": "3:25 PM",
        "Lunch starts at 1:10 PM and lasts 30 minutes. When does it end?": "1:40 PM",
        "Dinner is at 7:45 PM. Dessert is served 35 minutes later. What time is dessert?": "8:20 PM",
        "A train leaves at 6:40 AM and travels for 2 hours 30 minutes. When does it arrive?": "9:10 AM",
        "The train departs at 9:25 PM and arrives 3 hours 15 minutes later. When is arrival?": "12:40 AM",
        "You board a train at 1:10 PM. The journey lasts 1 hour 50 minutes. When do you arrive?": "3:00 PM",
        "A train leaves at 4:55 PM for a 2 hour 45 minute ride. When does it arrive?": "7:40 PM",
        "The train departs at 7:35 AM and the journey is 2 hours 15 minutes. When do you reach the destination?": "9:50 AM",
        "Train leaves at 10:10 AM and rides for 1 hour 40 minutes. When do you arrive?": "11:50 AM",
        "You take the train at 5:05 PM for 3 hours 10 minutes. When do you arrive?": "8:15 PM",
        "The train departs at 3:15 PM and arrives at 6:20 PM. How long is the trip?": "3 hours 5 minutes",
        "Train leaves at 8:40 AM for 2 hours 50 minutes. what time does it arrive?": "11:30 AM",
        "A train departs at 2:25 PM and travels 3 hours 15 minutes. When does it reach?": "5:40 PM",
        "You board a train at 6:55 PM for a 1 hour 45 minute ride. When is arrival?": "8:40 PM",
        "The train leaves at 9:05 AM and takes 3 hours 20 minutes. When do you arrive?": "12:25 PM",
        "School starts at 8:25 AM and lasts 6 hours 50 minutes. When does it end?": "3:15 PM",
        "A lecture begins at 10:40 AM and ends at 12:10 PM. How long was it?": "1 hour 30 minutes",
        "School ends at 3:30 PM. Sports practice starts 20 minutes later and lasts 1 hour 40 minutes. When does it finish?": "5:30 PM",
        "School starts at 9:15 AM and finishes 6 hours 15 minutes later. What time is dismissal?": "3:30 PM",
        "A math test starts at 2:05 PM and ends at 3:20 PM. How long was it?": "1 hour 15 minutes",
        "School starts at 8:50 AM and lasts 7 hours 5 minutes. When does it finish?": "3:55 PM",
        "School ends at 2:45 PM. Club activity starts 15 minutes later and runs 1 hour 35 minutes. When is it over?": "4:35 PM",
        "A lecture begins at 10:25 AM and ends at 12:00 PM. How long was the lecture?": "1 hour 35 minutes",
        "School starts at 8:15 AM and ends at 3:00 PM. How long is the day?": "6 hours 45 minutes",
        "A test runs from 1:20 PM to 2:05 PM. How long was it?": "45 minutes",
        "School begins at 8:20 AM and ends 6 hours 35 minutes later. When does it end?": "2:55 PM",
        "After-school program begins at 3:10 PM and runs 1 hour 50 minutes. When does it finish?": "5:00 PM",
        "Class starts at 8:35 AM. Lunch is 3 hours 25 minutes later. What time is lunch?": "12:00 PM",
        "School begins at 9:00 AM and runs 6 hours 40 minutes. When does it end?": "3:40 PM",
        "Music class runs from 1:15 PM to 2:00 PM. How long is it?": "45 minutes",
        "School starts at 8:10 AM and ends at 2:50 PM. How long is the school day?": "6 hours 40 minutes",
        "School ends at 3:20 PM. Homework takes 1 hour 15 minutes. When do you finish?": "4:35 PM",
        "School begins at 9:05 AM. Dismissal is 6 hours 25 minutes later. When is it?": "3:30 PM",
        "Class starts at 11:10 AM and ends at 11:55 AM. Duration?": "45 minutes",
        "School runs from 8:30 AM to 3:05 PM. How long is the day?": "6 hours 35 minutes",
        "Exam starts at 9:00 AM and ends at 10:50 AM. How long was it?": "1 hour 50 minutes",
        "School starts at 8:20 AM and ends at 2:50 PM. Total hours?": "6 hours 30 minutes",
        "Club meeting begins at 4:05 PM and lasts 50 minutes. When is it over?": "4:55 PM",
        "School ends at 3:30 PM. Bus departs 20 minutes later and takes 45 minutes. When do you get home?": "4:35 PM",
        "School starts at 9:10 AM. Lunch is 3 hours 25 minutes later. What time is lunch?": "12:35 PM",
        "School begins at 8:55 AM and lasts 7 hours 10 minutes. When does it finish?": "4:05 PM",
        "English class runs from 1:25 PM to 2:15 PM. How long?": "50 minutes",
        "School starts at 8:15 AM and ends at 2:50 PM. Duration?": "6 hours 35 minutes",
        "School ends at 3:40 PM. Club starts 40 minutes later and runs 1 hour 15 minutes. When does it end?": "5:35 PM",
        "School begins at 8:05 AM and ends at 2:50 PM. How long is the day?": "6 hours 45 minutes",
        "Bus picks up at 7:35 AM. School begins 30 minutes later. What time is school?": "8:05 AM",
        "School ends at 2:50 PM. Homework lasts 1 hour 20 minutes. When do you finish?": "4:10 PM",
        "School starts at 9:35 AM. Dismissal is 6 hours 20 minutes later. When is it?": "3:55 PM",
        "Class starts at 10:45 AM and ends at 11:35 AM. Duration?": "50 minutes",
        "School runs from 8:25 AM to 3:05 PM. How long is it?": "6 hours 40 minutes",
        "Exam starts at 9:10 AM and ends at 11:00 AM. Duration?": "1 hour 50 minutes",
        "School begins at 8:20 AM and ends at 2:50 PM. Duration?": "6 hours 30 minutes",
        "Club begins at 4:15 PM and lasts 55 minutes. When does it end?": "5:10 PM",
        "School ends at 3:25 PM. Tutoring starts 15 minutes later and runs 1 hour 25 minutes. When is it over?": "5:05 PM",
        "Test begins at 10:25 AM and ends at 11:50 AM. How long?": "1 hour 25 minutes",
        "School starts at 8:05 AM and ends at 2:50 PM. How long is the day?": "6 hours 45 minutes",
        "School ends at 3:15 PM. If it lasted 6 hours 40 minutes, when did it start?": "8:35 AM",
        "School begins at 9:20 AM and lasts 6 hours 20 minutes. When does it end?": "3:40 PM",
        "Class starts at 11:05 AM and ends at 11:50 AM. Duration?": "45 minutes",
        "Breakfast begins at 7:00 AM and lasts 25 minutes. When does it end?": "7:25 AM",
        "Lunch begins at 12:10 PM and lasts 35 minutes. When does it end?": "12:45 PM",
        "Dinner starts at 6:30 PM and lasts 55 minutes. When is it over?": "7:25 PM",
        "Breakfast is at 7:10 AM. Lunch is 5 hours 30 minutes later. When is lunch?": "12:40 PM",
        "Snack starts at 3:25 PM and lasts 20 minutes. When do you finish?": "3:45 PM",
        "Dinner begins at 7:15 PM and lasts 1 hour. When does it end?": "8:15 PM",
        "Breakfast is at 6:50 AM. Lunch is 6 hours 5 minutes later. What time is lunch?": "12:55 PM",
        "Lunch begins at 1:05 PM and lasts 35 minutes. When does it finish?": "1:40 PM",
        "Dinner starts at 8:05 PM and lasts 40 minutes. When is it done?": "8:45 PM",
        "Snack is at 9:50 AM. Breakfast was at 7:25 AM. How long between meals?": "2 hours 25 minutes",
        "Lunch begins at 12:35 PM and lasts 30 minutes. When is it done?": "1:05 PM",
        "Dinner starts at 6:55 PM and lasts 1 hour 5 minutes. When does it end?": "8:00 PM",
        "Lunch starts at 12:45 PM and lasts 25 minutes. When does it end?": "1:10 PM",
        "Dessert is at 8:20 PM, 35 minutes after dinner began at 7:45 PM. Confirm time?": "8:20 PM",
        "Breakfast starts at 6:55 AM. Lunch is 5 hours 20 minutes later. When is lunch?": "12:15 PM",
        "Dinner begins at 7:25 PM and lasts 1 hour 5 minutes. When does it end?": "8:30 PM",
        "Snack starts at 4:10 PM and lasts 20 minutes. When do you finish?": "4:30 PM",
        "Lunch begins at 12:05 PM and lasts 50 minutes. When does it finish?": "12:55 PM",
        "Snack begins at 3:50 PM and lasts 25 minutes. When does it finish?": "4:15 PM",
        "Breakfast starts at 7:25 AM and lasts 20 minutes. When does it end?": "7:45 AM",
        "Lunch is at 12:50 PM and lasts 45 minutes. When does it finish?": "1:35 PM",
        "A train leaves at 7:15 AM and travels for 2 hours 25 minutes. When does it arrive?": "9:40 AM",
        "The train departs at 10:40 PM and takes 3 hours 10 minutes. When is arrival?": "1:50 AM",
        "You board a train at 5:20 PM. The ride lasts 1 hour 45 minutes. When do you arrive?": "7:05 PM",
        "A train leaves at 2:10 PM for 2 hours 35 minutes. When does it arrive?": "4:45 PM",
        "The train departs at 8:55 AM and travels 3 hours 20 minutes. what time does it arrive?": "12:15 PM",
        "Train leaves at 11:05 AM and rides for 1 hour 55 minutes. When do you arrive?": "1:00 PM",
        "You take the train at 6:40 PM for 3 hours 5 minutes. When do you arrive?": "9:45 PM",
        "The train leaves at 9:20 AM and arrives at 12:25 PM. How long is the trip?": "3 hours 5 minutes",
        "Train leaves at 7:50 AM for 2 hours 40 minutes. what time does it arrive?": "10:30 AM",
        "A train departs at 3:35 PM and travels 3 hours 15 minutes. When does it reach?": "6:50 PM",
        "You board a train at 8:25 PM for 1 hour 50 minutes. When is arrival?": "10:15 PM",
        "School starts at 8:35 AM and lasts 6 hours 55 minutes. When does it end?": "3:30 PM",
        "A lecture begins at 10:15 AM and ends at 12:00 PM. How long was it?": "1 hour 45 minutes",
        "School ends at 3:25 PM. Sports practice starts 25 minutes later and lasts 1 hour 35 minutes. When does it finish?": "5:25 PM",
        "School starts at 9:10 AM and finishes 6 hours 15 minutes later. What time is dismissal?": "3:25 PM",
        "A math test starts at 2:15 PM and ends at 3:20 PM. How long was it?": "1 hour 5 minutes",
        "School starts at 8:45 AM and lasts 7 hours 10 minutes. When does it finish?": "3:55 PM",
        "School ends at 2:50 PM. Club activity starts 15 minutes later and runs 1 hour 25 minutes. When is it over?": "4:30 PM",
        "A lecture begins at 10:35 AM and ends at 12:10 PM. How long was the lecture?": "1 hour 35 minutes",
        "School starts at 8:20 AM and ends at 2:55 PM. How long is the day?": "6 hours 35 minutes",
        "A test runs from 1:30 PM to 2:10 PM. How long was it?": "40 minutes",
        "School begins at 8:15 AM and ends 6 hours 40 minutes later. When does it end?": "2:55 PM",
        "A train leaves at 6:25 AM and travels for 2 hours 10 minutes. When does it arrive?": "8:35 AM",
        "The train departs at 11:50 PM and takes 3 hours 5 minutes. When is arrival?": "2:55 AM",
        "You board a train at 5:30 PM. The ride lasts 1 hour 45 minutes. When do you arrive?": "7:15 PM",
        "A train leaves at 1:10 PM for 2 hours 50 minutes. When does it arrive?": "4:00 PM",
        "The train departs at 9:05 AM and travels 3 hours 15 minutes. what time does it arrive?": "12:20 PM",
        "Train leaves at 10:40 AM and rides for 1 hour 50 minutes. When do you arrive?": "12:30 PM",
        "You take the train at 6:15 PM for 3 hours 20 minutes. When do you arrive?": "9:35 PM",
        "The train leaves at 8:50 AM and arrives at 11:55 AM. How long is the trip?": "3 hours 5 minutes",
        "Train leaves at 7:10 AM for 2 hours 25 minutes. what time does it arrive?": "9:35 AM",
        "A train departs at 2:55 PM and travels 3 hours 10 minutes. When does it reach?": "6:05 PM",
        "You board a train at 8:40 PM for 1 hour 50 minutes. When is arrival?": "10:30 PM",
        "A lecture begins at 10:25 AM and ends at 12:05 PM. How long was it?": "1 hour 40 minutes",
        "School ends at 3:15 PM. Sports practice starts 20 minutes later and lasts 1 hour 45 minutes. When does it finish?": "5:20 PM",
        "School starts at 9:05 AM and finishes 6 hours 25 minutes later. What time is dismissal?": "3:30 PM",
        "A math test starts at 2:05 PM and ends at 3:15 PM. How long was it?": "1 hour 10 minutes",
        "A lecture begins at 10:15 AM and ends at 11:55 AM. How long was the lecture?": "1 hour 40 minutes",
        "School starts at 8:25 AM and ends at 2:55 PM. How long is the day?": "6 hours 30 minutes",
        "A test runs from 1:35 PM to 2:15 PM. How long was it?": "40 minutes",
        "School begins at 8:05 AM and ends 6 hours 40 minutes later. When does it end?": "2:45 PM",
        "School ends at 3:10 PM. Tutoring begins 20 minutes later and runs 1 hour 20 minutes. When does it finish?": "4:50 PM",
        "School starts at 8:15 AM and ends at 2:50 PM. How long is the day?": "6 hours 35 minutes",
        "Club meeting begins at 4:05 PM and lasts 55 minutes. When does it end?": "5:00 PM",
        "School ends at 3:20 PM. Homework takes 1 hour 25 minutes. When do you finish?": "4:45 PM",
        "School begins at 9:10 AM. Lunch is 3 hours 20 minutes later. What time is lunch?": "12:30 PM",
        "School begins at 8:55 AM and lasts 7 hours 5 minutes. When does it finish?": "4:00 PM",
        "English class runs from 1:25 PM to 2:10 PM. How long?": "45 minutes",
        "School starts at 8:05 AM and ends at 2:50 PM. Duration?": "6 hours 45 minutes",
        "School ends at 3:30 PM. Club starts 35 minutes later and runs 1 hour 20 minutes. When does it end?": "4:55 PM",
        "School begins at 8:10 AM and ends at 2:55 PM. How long is the day?": "6 hours 45 minutes",
        "School ends at 2:50 PM. Homework lasts 1 hour 15 minutes. When do you finish?": "4:05 PM",
        "School starts at 9:15 AM. Dismissal is 6 hours 20 minutes later. When is it?": "3:35 PM",
        "A train leaves at 6:45 AM and travels for 2 hours 15 minutes. When does it arrive?": "9:00 AM",
        "The train departs at 9:30 PM and takes 3 hours 40 minutes. When is arrival?": "1:10 AM",
        "You board a train at 4:55 PM. The ride lasts 2 hours 5 minutes. When do you arrive?": "7:00 PM",
        "A train leaves at 1:20 PM for 2 hours 40 minutes. When does it arrive?": "4:00 PM",
        "The train departs at 10:10 AM and travels 3 hours 30 minutes. what time does it arrive?": "1:40 PM",
        "Train leaves at 11:25 AM and rides for 1 hour 45 minutes. When do you arrive?": "1:10 PM",
        "You take the train at 7:15 PM for 3 hours 10 minutes. When do you arrive?": "10:25 PM",
        "The train leaves at 8:35 AM and arrives at 11:50 AM. How long is the trip?": "3 hours 15 minutes",
        "Train leaves at 6:55 AM for 2 hours 35 minutes. what time does it arrive?": "9:30 AM",
        "A train departs at 3:20 PM and travels 3 hours 25 minutes. When does it reach?": "6:45 PM",
        "You board a train at 8:55 PM for 1 hour 55 minutes. When is arrival?": "10:50 PM",
        "School starts at 8:05 AM and lasts 6 hours 50 minutes. When does it end?": "2:55 PM",
        "A lecture begins at 10:05 AM and ends at 11:50 AM. How long was it?": "1 hour 45 minutes",
        "School ends at 3:10 PM. Sports practice starts 20 minutes later and lasts 1 hour 40 minutes. When does it finish?": "4:70 PM",
        "School starts at 9:15 AM and finishes 6 hours 30 minutes later. What time is dismissal?": "3:45 PM",
        "A math test starts at 1:55 PM and ends at 3:05 PM. How long was it?": "1 hour 10 minutes",
        "School starts at 8:40 AM and lasts 7 hours 10 minutes. When does it finish?": "3:50 PM",
        "School ends at 2:50 PM. Club activity starts 15 minutes later and runs 1 hour 30 minutes. When is it over?": "4:35 PM",
        "A lecture begins at 10:20 AM and ends at 12:00 PM. How long was the lecture?": "1 hour 40 minutes",
        "School starts at 8:30 AM and ends at 2:55 PM. How long is the day?": "6 hours 25 minutes",
        "A test runs from 1:40 PM to 2:20 PM. How long was it?": "40 minutes",
        "School begins at 8:00 AM and ends 6 hours 45 minutes later. When does it end?": "2:45 PM",
        "School ends at 3:20 PM. Tutoring begins 20 minutes later and runs 1 hour 15 minutes. When does it finish?": "4:55 PM",
        "School starts at 8:10 AM and ends at 2:55 PM. How long is the day?": "6 hours 45 minutes",
        "Club meeting begins at 4:10 PM and lasts 50 minutes. When does it end?": "5:00 PM",
        "School ends at 3:25 PM. Homework takes 1 hour 20 minutes. When do you finish?": "4:45 PM",
        "School begins at 9:05 AM. Lunch is 3 hours 25 minutes later. What time is lunch?": "12:30 PM",
        "School begins at 8:50 AM and lasts 7 hours 0 minutes. When does it finish?": "3:50 PM",
        "English class runs from 1:30 PM to 2:15 PM. How long?": "45 minutes",
        "School starts at 8:00 AM and ends at 2:50 PM. Duration?": "6 hours 50 minutes",
        "School ends at 3:15 PM. Club starts 30 minutes later and runs 1 hour 15 minutes. When does it end?": "4:60 PM",
        "School begins at 8:05 AM and ends at 2:55 PM. How long is the day?": "6 hours 50 minutes",
        "Bus picks up at 7:30 AM. School begins 30 minutes later. What time is school?": "8:00 AM",
        "School ends at 2:50 PM. Homework lasts 1 hour 10 minutes. When do you finish?": "4:00 PM",
        "School starts at 9:25 AM. Dismissal is 6 hours 15 minutes later. When is it?": "3:40 PM",
        "Class starts at 10:50 AM and ends at 11:35 AM. Duration?": "45 minutes",
        "School runs from 8:20 AM to 3:00 PM. How long is it?": "6 hours 40 minutes",
        "Exam starts at 9:15 AM and ends at 11:00 AM. Duration?": "1 hour 45 minutes",
        "School begins at 8:25 AM and ends at 2:55 PM. Duration?": "6 hours 30 minutes",
        "Club begins at 4:05 PM and lasts 50 minutes. When does it end?": "4:55 PM",
        "School ends at 3:15 PM. Tutoring starts 20 minutes later and runs 1 hour 20 minutes. When is it over?": "4:55 PM",
        "Test begins at 10:20 AM and ends at 11:40 AM. How long?": "1 hour 20 minutes",
        "School starts at 8:00 AM and ends at 2:55 PM. How long is the day?": "6 hours 55 minutes",
        "School ends at 3:10 PM. If it lasted 6 hours 40 minutes, when did it start?": "8:30 AM",
        "School starts at 9:20 AM and lasts 6 hours 15 minutes. When does it end?": "3:35 PM",
        "Class starts at 11:00 AM and ends at 11:50 AM. Duration?": "50 minutes",
        "Breakfast begins at 6:50 AM and lasts 25 minutes. When does it end?": "7:15 AM",
        "Lunch begins at 12:15 PM and lasts 35 minutes. When does it end?": "12:50 PM",
        "Dinner starts at 6:40 PM and lasts 55 minutes. When is it over?": "7:35 PM",
        "Breakfast is at 7:05 AM. Lunch is 5 hours 35 minutes later. When is lunch?": "12:40 PM",
        "Snack starts at 3:15 PM and lasts 20 minutes. When do you finish?": "3:35 PM",
        "Dinner begins at 7:10 PM and lasts 1 hour. When does it end?": "8:10 PM",
        "Breakfast is at 6:45 AM. Lunch is 6 hours 10 minutes later. What time is lunch?": "12:55 PM",
        "Lunch begins at 1:00 PM and lasts 35 minutes. When does it finish?": "1:35 PM",
        "Dinner starts at 8:10 PM and lasts 40 minutes. When is it done?": "8:50 PM",
        "Snack is at 9:45 AM. Breakfast was at 7:20 AM. How long between meals?": "2 hours 25 minutes",
        "Lunch begins at 12:40 PM and lasts 30 minutes. When does it finish?": "1:10 PM",
        "Dinner starts at 6:50 PM and lasts 1 hour 5 minutes. When does it end?": "7:55 PM",
        "Breakfast begins at 7:10 AM and lasts 40 minutes. When does it finish?": "7:50 AM",
        "Dessert is at 8:25 PM, 35 minutes after dinner began at 7:50 PM. Confirm time?": "8:25 PM",
        "Breakfast starts at 6:55 AM. Lunch is 5 hours 25 minutes later. When is lunch?": "12:20 PM",
        "Dinner begins at 7:20 PM and lasts 1 hour 5 minutes. When does it end?": "8:25 PM",
        "Snack starts at 4:15 PM and lasts 20 minutes. When do you finish?": "4:35 PM",
        "Lunch begins at 12:10 PM and lasts 50 minutes. When does it finish?": "1:00 PM",
        "Breakfast starts at 6:40 AM and lasts 30 minutes. When does it end?": "7:10 AM",
        "Dinner begins at 6:30 PM and lasts 1 hour 15 minutes. When does it finish?": "7:45 PM",
        "Breakfast starts at 7:15 AM. Lunch follows 5 hours later. What time is lunch?": "12:15 PM",
        "Snack begins at 3:55 PM and lasts 25 minutes. When does it finish?": "4:20 PM",
        "A train departs at 7:50 AM and travels for 3 hours 25 minutes. When does it arrive?": "11:15 AM",
        "School starts at 8:10 AM and lasts 6 hours 50 minutes. When does it end?": "3:00 PM",
        "Breakfast begins at 6:45 AM and lasts 30 minutes. When does it end?": "7:15 AM",
        "You leave home at 9:15 AM for a 2 hour 20 minute drive. When do you arrive?": "11:35 AM",
        "A football match starts at 4:05 PM and lasts 1 hour 40 minutes. When does it finish?": "5:45 PM",
        "Lunch is at 12:10 PM. Dinner is 5 hours 50 minutes later. When is dinner?": "6:00 PM",
        "School ends at 2:55 PM. Practice starts 20 minutes later and lasts 1 hour 30 minutes. When does practice end?": "4:45 PM",
        "You start jogging at 6:30 AM for 1 hour 10 minutes. When do you finish?": "7:40 AM",
        "A train leaves at 8:20 AM and the ride takes 3 hours 40 minutes. When does it arrive?": "12:00 PM",
        "Dinner begins at 6:20 PM and lasts 1 hour 25 minutes. When is it done?": "7:45 PM",
        "School starts at 7:55 AM and lasts 5 hours 45 minutes. When does it end?": "1:40 PM",
        "You start cooking at 5:30 PM. The recipe takes 1 hour 45 minutes. When is dinner ready?": "7:15 PM",
        "A lecture starts at 10:10 AM and ends at 12:35 PM. How long was it?": "2 hours 25 minutes",
        "Snack starts at 3:05 PM and lasts 15 minutes. When do you finish?": "3:20 PM",
        "School ends at 3:20 PM. The after-school program lasts 2 hours 15 minutes. When does it end?": "5:35 PM",
        "A train departs at 9:10 AM and travels for 4 hours 5 minutes. When does it arrive?": "1:15 PM",
        "Breakfast starts at 6:35 AM and lasts 30 minutes. When does it end?": "7:05 AM",
        "Lunch begins at 12:20 PM and lasts 40 minutes. When does it finish?": "1:00 PM",
        "You leave work at 5:10 PM and drive home for 50 minutes. When do you arrive?": "6:00 PM",
        "A movie starts at 6:35 PM and lasts 2 hours 25 minutes. When does it finish?": "8:60 PM",
        "School starts at 9:00 AM. The first class begins immediately and lasts 1 hour 50 minutes. When does the first class end?": "10:50 AM",
        "Dinner starts at 6:40 PM and lasts 1 hour 15 minutes. When do you finish?": "7:55 PM",
        "You start a study session at 7:25 PM for 1 hour 45 minutes. When do you finish?": "9:10 PM",
        "School ends at 2:40 PM. Practice starts 15 minutes later and lasts 1 hour 30 minutes. When does practice end?": "4:25 PM",
        "You start homework at 4:50 PM and spend 1 hour 30 minutes on it. When do you finish?": "6:20 PM",
        "Lunch begins at 12:15 PM and lasts 45 minutes. When does it finish?": "1:00 PM",
        "A train departs at 5:20 PM and the ride lasts 3 hours 50 minutes. When does it arrive?": "9:10 PM",
        "Breakfast starts at 7:10 AM and lasts 25 minutes. When does it end?": "7:35 AM",
        "School starts at 8:25 AM and ends at 2:55 PM. How long is the school day?": "6 hours 30 minutes",
        "Dinner begins at 6:50 PM and lasts 1 hour 10 minutes. When is it done?": "8:00 PM",
        "Snack begins at 3:25 PM and lasts 20 minutes. When do you finish?": "3:45 PM",
        "A train leaves at 10:25 AM and travels for 2 hours 55 minutes. When does it arrive?": "1:20 PM",
        "You start jogging at 6:50 AM for 1 hour 20 minutes. When do you finish?": "8:10 AM",
        "Lunch is at 12:05 PM. Snack is 5 hours 10 minutes later. When is snack?": "5:15 PM",
        "School starts at 9:20 AM and lasts 6 hours 10 minutes. When does it end?": "3:30 PM",
        "A lecture starts at 1:40 PM and ends at 4:05 PM. How long did the lecture last?": "2 hours 25 minutes",
        "Dinner begins at 6:10 PM and lasts 1 hour 35 minutes. When is it done?": "7:45 PM",
        "A bus departs at 3:15 PM and arrives 1 hour 25 minutes later. When does it arrive?": "4:40 PM",
        "Breakfast begins at 6:50 AM and lasts 30 minutes. When does it end?": "7:20 AM",
        "School ends at 2:55 PM. The after-school program lasts 2 hours 20 minutes. When does it end?": "5:15 PM",
        "A train departs at 2:15 PM and travels for 3 hours 40 minutes. When does it arrive?": "5:55 PM",
        "Lunch begins at 12:25 PM and lasts 45 minutes. When does it finish?": "1:10 PM",
        "Dinner begins at 6:25 PM and lasts 1 hour 20 minutes. When is it done?": "7:45 PM",
        "A train leaves at 5:05 PM and travels for 3 hours 55 minutes. When does it arrive?": "9:00 PM",
        "Snack begins at 3:10 PM and lasts 15 minutes. When do you finish?": "3:25 PM",
        "Breakfast starts at 7:05 AM and lasts 35 minutes. When does it end?": "7:40 AM",
        "You leave home at 9:30 AM for a 2 hour 25 minute drive. When do you arrive?": "11:55 AM",
        "School ends at 3:20 PM. Practice starts 15 minutes later and lasts 1 hour 35 minutes. When does practice end?": "5:10 PM",
        "Dinner starts at 6:30 PM and lasts 1 hour 25 minutes. When do you finish?": "7:55 PM",
        "Breakfast begins at 6:40 AM and lasts 40 minutes. When does it end?": "7:20 AM",
        "A train departs at 8:05 AM and travels for 3 hours 40 minutes. When does it arrive?": "11:45 AM",
        "Snack starts at 3:05 PM and lasts 20 minutes. When do you finish?": "3:25 PM",
        "Lunch begins at 12:15 PM and lasts 50 minutes. When does it finish?": "1:05 PM",
        "A train leaves at 10:55 PM and takes 6 hours 15 minutes. When do you arrive?": "5:10 AM",
        "School ends at 3:25 PM. A club meeting starts 20 minutes later and lasts 1 hour 15 minutes. When does it end?": "4:60 PM",
        "Dinner begins at 6:15 PM and lasts 1 hour 30 minutes. When is it done?": "7:45 PM",
        "Breakfast starts at 6:30 AM and lasts 35 minutes. When does it end?": "7:05 AM",
        "Lunch begins at 12:00 PM and lasts 45 minutes. When does it finish?": "12:45 PM",
        "Dinner begins at 6:40 PM and lasts 1 hour 20 minutes. When is it done?": "8:00 PM",
        "You start a study session at 5:25 PM for 2 hours 10 minutes. When do you stop?": "7:35 PM",
        "Snack starts at 3:30 PM and lasts 15 minutes. When do you finish?": "3:45 PM",
        "School ends at 2:45 PM. A bus departs 30 minutes later for a 1 hour 45 minute trip. When do you arrive home?": "5:00 PM",
        "Dinner begins at 6:25 PM and lasts 1 hour 15 minutes. When is it done?": "7:40 PM",
        "A train departs at 2:15 PM and the ride lasts 3 hours 40 minutes. When does it arrive?": "5:55 PM",
        "A train departs at 7:40 AM and travels for 3 hours 15 minutes. When does it arrive?": "10:55 AM",
        "You leave home at 9:05 AM for a 2 hour 15 minute drive. When do you arrive?": "11:20 AM",
        "A football match starts at 4:10 PM and lasts 1 hour 45 minutes. When does it finish?": "5:55 PM",
        "Lunch is at 12:05 PM. Dinner is 5 hours 45 minutes later. When is dinner?": "5:50 PM",
        "School ends at 3:10 PM. Practice starts 20 minutes later and lasts 1 hour 25 minutes. When does practice end?": "4:55 PM",
        "You start jogging at 6:25 AM for 1 hour 20 minutes. When do you finish?": "7:45 AM",
        "A train leaves at 8:30 AM and the ride takes 3 hours 50 minutes. When does it arrive?": "12:20 PM",
        "Dinner begins at 6:10 PM and lasts 1 hour 30 minutes. When is it done?": "7:40 PM",
        "School starts at 7:50 AM and lasts 5 hours 50 minutes. When does it end?": "1:40 PM",
        "You start cooking at 5:25 PM. The recipe takes 1 hour 40 minutes. When is dinner ready?": "7:05 PM",
        "A lecture starts at 10:15 AM and ends at 12:40 PM. How long was it?": "2 hours 25 minutes",
        "Snack starts at 3:20 PM and lasts 15 minutes. When do you finish?": "3:35 PM",
        "School ends at 3:15 PM. The after-school program lasts 2 hours 10 minutes. When does it end?": "5:25 PM",
        "A train departs at 9:20 AM and travels for 4 hours 10 minutes. When does it arrive?": "1:30 PM",
        "Breakfast starts at 6:45 AM and lasts 30 minutes. When does it end?": "7:15 AM",
        "Lunch begins at 12:15 PM and lasts 40 minutes. When does it finish?": "12:55 PM",
        "You leave work at 5:00 PM and drive home for 55 minutes. When do you arrive?": "5:55 PM",
        "A movie starts at 6:45 PM and lasts 2 hours 10 minutes. When does it finish?": "8:55 PM",
        "School starts at 9:05 AM. The first class begins immediately and lasts 1 hour 45 minutes. When does the first class end?": "10:50 AM",
        "Dinner starts at 6:25 PM and lasts 1 hour 20 minutes. When do you finish?": "7:45 PM",
        "You start a study session at 7:15 PM for 1 hour 40 minutes. When do you finish?": "8:55 PM",
        "A bus departs at 7:10 AM and arrives at 9:45 AM. How long was the trip?": "2 hours 35 minutes",
        "School ends at 2:50 PM. Practice starts 15 minutes later and lasts 1 hour 40 minutes. When does practice end?": "4:45 PM",
        "You start homework at 5:00 PM and spend 1 hour 25 minutes on it. When do you finish?": "6:25 PM",
        "Lunch begins at 12:10 PM and lasts 45 minutes. When does it finish?": "12:55 PM",
        "A train departs at 5:10 PM and the ride lasts 3 hours 45 minutes. When does it arrive?": "8:55 PM",
        "Breakfast starts at 7:00 AM and lasts 25 minutes. When does it end?": "7:25 AM",
        "Dinner begins at 6:35 PM and lasts 1 hour 15 minutes. When is it done?": "7:50 PM",
        "Snack begins at 3:30 PM and lasts 20 minutes. When do you finish?": "3:50 PM",
        "A train leaves at 10:35 AM and travels for 2 hours 50 minutes. When does it arrive?": "1:25 PM",
        "School ends at 3:00 PM. A tutoring session starts 25 minutes later and lasts 1 hour 15 minutes. When does it finish?": "4:40 PM",
        "You start jogging at 6:40 AM for 1 hour 15 minutes. When do you finish?": "7:55 AM",
        "Lunch is at 12:00 PM. Snack is 5 hours later. When is snack?": "5:00 PM",
        "School starts at 9:15 AM and lasts 6 hours 20 minutes. When does it end?": "3:35 PM",
        "A lecture starts at 1:35 PM and ends at 4:00 PM. How long did the lecture last?": "2 hours 25 minutes",
        "A train departs at 8:45 AM and travels for 3 hours 35 minutes. When does it arrive?": "12:20 PM",
        "School starts at 8:30 AM and lasts 6 hours 25 minutes. When does it end?": "2:55 PM",
        "Breakfast begins at 7:05 AM and lasts 30 minutes. When does it end?": "7:35 AM",
        "A train departs at 7:55 AM and travels for 3 hours 10 minutes. When does it arrive?": "11:05 AM",
        "School starts at 8:20 AM and lasts 6 hours 15 minutes. When does it end?": "2:35 PM",
        "Breakfast begins at 6:50 AM and lasts 35 minutes. When does it end?": "7:25 AM",
        "You leave home at 9:10 AM for a 2 hour 30 minute drive. When do you arrive?": "11:40 AM",
        "A football match starts at 4:00 PM and lasts 1 hour 55 minutes. When does it finish?": "5:55 PM",
        "Lunch is at 12:05 PM. Dinner is 5 hours 35 minutes later. When is dinner?": "5:40 PM",
        "School ends at 3:15 PM. Practice starts 20 minutes later and lasts 1 hour 35 minutes. When does practice end?": "5:10 PM",
        "You start jogging at 6:20 AM for 1 hour 25 minutes. When do you finish?": "7:45 AM",
        "A train leaves at 8:10 AM and the ride takes 3 hours 45 minutes. When does it arrive?": "11:55 AM",
        "Dinner begins at 6:15 PM and lasts 1 hour 20 minutes. When is it done?": "7:35 PM",
        "School starts at 7:50 AM and lasts 5 hours 40 minutes. When does it end?": "1:30 PM",
        "You start cooking at 5:20 PM. The recipe takes 1 hour 35 minutes. When is dinner ready?": "6:55 PM",
        "A lecture starts at 10:20 AM and ends at 12:45 PM. How long was it?": "2 hours 25 minutes",
        "School ends at 3:10 PM. The after-school program lasts 2 hours 15 minutes. When does it end?": "5:25 PM",
        "A train departs at 9:15 AM and travels for 4 hours 5 minutes. When does it arrive?": "1:20 PM",
        "A train departs at 6:25 AM and travels 3 hours 40 minutes. What time does it arrive?": "10:05 AM",
        "A bus leaves at 7:50 AM and takes 2 hours 20 minutes. What time does it arrive?": "10:10 AM",
        "A train leaves at 5:15 PM and arrives 4 hours 35 minutes later. What time does it arrive?": "9:50 PM",
        "A bus departs at 11:10 AM and reaches its destination after 1 hour 50 minutes. What time does it arrive?": "1:00 PM",
        "A train leaves at 2:25 PM and travels 5 hours 5 minutes. What time does it arrive?": "7:30 PM",
        "A bus starts at 8:00 AM and drives 3 hours 35 minutes. What time does it arrive?": "11:35 AM",
        "A train departs at 9:50 AM and travels 2 hours 55 minutes. What time does it arrive?": "12:45 PM",
        "A bus leaves at 1:15 PM and drives 3 hours 20 minutes. What time does it arrive?": "4:35 PM",
        "A train departs at 4:20 PM and travels 3 hours 15 minutes. What time does it arrive?": "7:35 PM",
        "A bus leaves at 10:05 AM and takes 2 hours 40 minutes. What time does it arrive?": "12:45 PM",
        "A train leaves at 7:30 AM and arrives 5 hours 20 minutes later. What time does it arrive?": "12:50 PM",
        "A bus departs at 3:10 PM and reaches its destination after 1 hour 50 minutes. What time does it arrive?": "5:00 PM",
        "A train departs at 11:40 AM and travels 3 hours 50 minutes. What time does it arrive?": "3:30 PM",
        "A bus leaves at 6:35 AM and takes 2 hours 15 minutes. What time does it arrive?": "8:50 AM",
        "A train departs at 5:25 PM and travels 2 hours 35 minutes. What time does it arrive?": "8:00 PM",
        "A bus leaves at 12:15 PM and drives 3 hours 45 minutes. What time does it arrive?": "4:00 PM",
        "A train departs at 10:10 AM and travels 3 hours 55 minutes. What time does it arrive?": "2:05 PM",
        "A bus leaves at 6:50 AM and takes 2 hours 45 minutes. What time does it arrive?": "9:35 AM",
        "A train departs at 4:55 PM and travels 2 hours 35 minutes. What time does it arrive?": "7:30 PM",
        "A bus leaves at 1:20 PM and drives 3 hours 50 minutes. What time does it arrive?": "5:10 PM",
        "A train departs at 7:40 AM and travels 4 hours 10 minutes. What time does it arrive?": "11:50 AM",
        "A bus leaves at 9:25 AM and takes 2 hours 35 minutes. What time does it arrive?": "12:00 PM",
        "A train departs at 11:15 AM and travels 3 hours 25 minutes. What time does it arrive?": "2:40 PM",
        "A bus leaves at 8:40 AM and drives 2 hours 50 minutes. What time does it arrive?": "11:30 AM",
        "A train departs at 10:05 AM and travels 3 hours 45 minutes. What time does it arrive?": "1:50 PM",
        "A bus leaves at 7:30 AM and takes 2 hours 50 minutes. What time does it arrive?": "10:20 AM",
        "A bus leaves at 1:10 PM and drives 3 hours 15 minutes. What time does it arrive?": "4:25 PM",
        "School starts at 8:00 AM and each class lasts 45 minutes. What time is the 3rd class over?": "10:15 AM",
        "Morning assembly begins at 7:30 AM and lasts 20 minutes. When does it end?": "7:50 AM",
        "First break starts at 10:15 AM and lasts 15 minutes. What time is the next class?": "10:30 AM",
        "School starts at 9:00 AM. After 3 classes of 50 minutes each, what time is lunch?": "11:30 AM",
        "Morning class begins at 8:20 AM and ends at 9:10 AM. If the next class starts after 10 minutes, what time is it?": "9:20 AM",
        "School ends at 3:30 PM. If classes are 40 minutes each with 5-minute breaks, how many classes were there?": "7 classes",
        "A PE lesson starts at 1:00 PM and lasts 55 minutes. End time?": "1:55 PM",
        "A student arrives at school at 7:50 AM and first class starts at 8:00 AM. How long until the first break at 10:00 AM?": "2 hours",
        "Morning snack at 10:30 AM lasts 15 minutes. When is it over?": "10:45 AM",
        "Dinner begins at 6:45 PM and lasts 50 minutes. End time?": "7:35 PM",
        "Breakfast is at 8:00 AM. If lunch is 5 hours later, what time is lunch?": "1:00 PM",
        "Lunch is at 12:30 PM. Dinner comes 6 hours 15 minutes later. What time is dinner?": "6:45 PM",
        "School starts at 8:20 AM. After 2 classes and a 10-minute break, what time is it?": "9:55 AM",
        "Assembly at 8:30 AM ends 15 minutes later. What time is it?": "8:45 AM",
        "First class starts at 9:05 AM and lasts 50 minutes. When is it over?": "9:55 AM",
        "Breakfast is at 6:30 AM. If lunch is 5 hours 45 minutes later, what time is lunch?": "12:15 PM",
        "Lunch is at 1:15 PM. If dinner is 5 hours 30 minutes later, what time is dinner?": "6:45 PM",
        "A snack is at 2:50 PM. If the next meal is 3 hours 40 minutes later, what time is it?": "6:30 PM",
        "Dinner is at 6:20 PM. If a snack is 3 hours 25 minutes later, what time is it?": "9:45 PM",
        "School starts at 8:15 AM. After 3 classes of 45 minutes each, what time is lunch?": "10:30 AM",
        "Morning assembly begins at 7:40 AM and lasts 20 minutes. When does it end?": "8:00 AM",
        "Breakfast is at 7:15 AM. If lunch is 5 hours 10 minutes later, what time is lunch?": "12:25 PM",
        "Lunch is at 12:45 PM. Dinner comes 6 hours later. What time is dinner?": "6:45 PM",
        "School ends at 3:45 PM. If classes are 50 minutes each with 5-minute breaks, how many classes were there?": "5 classes",
        "A PE lesson starts at 2:00 PM and lasts 50 minutes. End time?": "2:50 PM",
        "A student arrives at school at 8:00 AM and first class starts at 8:10 AM. How long until first break at 10:00 AM?": "1 hour 50 minutes",
        "Morning snack at 10:00 AM lasts 20 minutes. End time?": "10:20 AM",
        "Dinner begins at 7:10 PM and lasts 40 minutes. End time?": "7:50 PM",
        "Breakfast is at 6:50 AM. If lunch is 5 hours 25 minutes later, what time is lunch?": "12:15 PM",
        "Lunch is at 12:10 PM. Dinner comes 6 hours 50 minutes later. What time is dinner?": "7:00 PM",
        "School starts at 8:25 AM. After 3 classes of 50 minutes each, what time is lunch?": "10:55 AM",
        "Breakfast is at 7:10 AM. If lunch is 5 hours 40 minutes later, what time is lunch?": "12:50 PM",
        "Lunch is at 12:15 PM. Dinner comes 6 hours 30 minutes later. What time is dinner?": "6:45 PM",
        "A snack is at 2:45 PM. If the next meal is 4 hours 10 minutes later, what time is it?": "6:55 PM",
        "Dinner is at 6:40 PM. If a snack is 3 hours 20 minutes later, what time is it?": "9:60 PM",
        "A train departs at 6:50 AM and travels 3 hours 25 minutes. What time does it arrive?": "10:15 AM",
        "A bus leaves at 7:35 AM and takes 2 hours 45 minutes. What time does it arrive?": "10:20 AM",
        "A train departs at 9:20 AM and travels 4 hours 10 minutes. What time does it arrive?": "1:30 PM",
        "A bus leaves at 1:05 PM and drives 3 hours 15 minutes. What time does it arrive?": "4:20 PM",
        "A train departs at 11:15 AM and travels 2 hours 50 minutes. What time does it arrive?": "2:05 PM",
        "A bus leaves at 8:50 AM and takes 3 hours 5 minutes. What time does it arrive?": "11:55 AM",
        "School starts at 8:05 AM and each class lasts 45 minutes. What time is the 4th class over?": "11:35 AM",
        "Morning assembly begins at 7:40 AM and lasts 15 minutes. When does it end?": "7:55 AM",
        "First break starts at 10:05 AM and lasts 20 minutes. What time is the next class?": "10:25 AM",
        "School starts at 9:10 AM. After 3 classes of 50 minutes each, what time is lunch?": "11:40 AM",
        "Breakfast is at 6:45 AM. If lunch is 5 hours 35 minutes later, what time is lunch?": "12:20 PM",
        "Lunch is at 12:20 PM. Dinner comes 6 hours 10 minutes later. What time is dinner?": "6:30 PM",
        "A snack is at 3:10 PM. If the next meal is 4 hours 20 minutes later, what time is it?": "7:30 PM",
        "Dinner is at 6:15 PM. If a snack is 3 hours 30 minutes later, what time is it?": "9:45 PM",
        "School starts at 8:25 AM. After 2 classes and a 10-minute break, what time is it?": "9:55 AM",
        "Assembly at 8:15 AM ends 15 minutes later. What time is it?": "8:30 AM",
        "First class starts at 9:00 AM and lasts 50 minutes. When is it over?": "9:50 AM",
        "Breakfast is at 7:00 AM. If lunch is 5 hours 40 minutes later, what time is lunch?": "12:40 PM",
        "Lunch is at 12:25 PM. Dinner comes 6 hours 15 minutes later. What time is dinner?": "6:40 PM",
        "A snack is at 2:35 PM. If the next meal is 3 hours 45 minutes later, what time is it?": "6:20 PM",
        "Dinner is at 6:50 PM. If a snack is 3 hours 25 minutes later, what time is it?": "10:15 PM",
        "A train departs at 10:30 AM and travels 3 hours 40 minutes. What time does it arrive?": "2:10 PM",
        "A bus leaves at 7:15 AM and takes 2 hours 55 minutes. What time does it arrive?": "10:10 AM",
        "School starts at 8:10 AM. After 3 classes of 45 minutes each, what time is lunch?": "10:55 AM",
        "Morning assembly begins at 7:35 AM and lasts 20 minutes. When does it end?": "7:55 AM",
        "Breakfast is at 6:55 AM. If lunch is 5 hours 25 minutes later, what time is lunch?": "12:20 PM",
        "A train departs at 5:25 PM and travels 2 hours 55 minutes. What time does it arrive?": "8:20 PM",
        "A bus leaves at 12:50 PM and drives 3 hours 15 minutes. What time does it arrive?": "4:05 PM",
        "School ends at 3:45 PM. If classes are 45 minutes each with 5-minute breaks, how many classes were there?": "6 classes",
        "A PE lesson starts at 1:15 PM and lasts 50 minutes. End time?": "2:05 PM",
        "A student arrives at school at 7:55 AM and first class starts at 8:05 AM. How long until first break at 10:00 AM?": "1 hour 55 minutes",
        "Morning snack at 10:15 AM lasts 15 minutes. End time?": "10:30 AM",
        "Dinner begins at 7:20 PM and lasts 45 minutes. End time?": "8:05 PM",
        "A train departs at 9:05 AM and travels 3 hours 30 minutes. What time does it arrive?": "12:35 PM",
        "A bus leaves at 8:10 AM and takes 2 hours 50 minutes. What time does it arrive?": "11:00 AM",
        "School starts at 8:00 AM. After 3 classes of 50 minutes each, what time is lunch?": "10:30 AM",
        "Breakfast is at 7:25 AM. If lunch is 5 hours 35 minutes later, what time is lunch?": "12:60 PM",
        "A train departs at 6:55 AM and travels 3 hours 50 minutes. What time does it arrive?": "10:45 AM",
        "A bus leaves at 8:20 AM and takes 2 hours 35 minutes. What time does it arrive?": "10:55 AM",
        "School starts at 8:15 AM. After 2 classes and a 10-minute break, what time is it?": "9:55 AM",
        "Assembly at 8:05 AM ends 15 minutes later. What time is it?": "8:20 AM",
        "First class starts at 9:10 AM and lasts 50 minutes. When is it over?": "10:00 AM",
        "Breakfast is at 6:40 AM. If lunch is 5 hours 50 minutes later, what time is lunch?": "12:30 PM",
        "Lunch is at 12:05 PM. Dinner comes 6 hours 40 minutes later. What time is dinner?": "6:45 PM",
        "A train departs at 5:35 PM and travels 3 hours 15 minutes. What time does it arrive?": "8:50 PM",
        "A bus leaves at 12:50 PM and takes 2 hours 55 minutes. What time does it arrive?": "3:45 PM",
        "A train departs at 10:15 AM and travels 3 hours 55 minutes. What time does it arrive?": "2:10 PM",
        "A bus leaves at 7:50 AM and takes 2 hours 45 minutes. What time does it arrive?": "10:35 AM",
        "A train departs at 6:15 AM and travels 2 hours 45 minutes. What time does it arrive?": "9:00 AM",
        "A bus leaves at 7:30 AM and drives 3 hours 10 minutes. What time does it arrive?": "10:40 AM",
        "A train departs at 8:05 AM and travels 3 hours 20 minutes. What time does it arrive?": "11:25 AM",
        "A bus leaves at 9:45 AM and takes 2 hours 50 minutes. What time does it arrive?": "12:35 PM",
        "A train departs at 10:20 AM and travels 4 hours 5 minutes. What time does it arrive?": "2:25 PM",
        "A bus leaves at 12:10 PM and drives 3 hours 15 minutes. What time does it arrive?": "3:25 PM",
        "School starts at 7:50 AM. After 3 classes of 40 minutes each, what time is lunch?": "9:50 AM",
        "Morning assembly begins at 8:00 AM and lasts 15 minutes. When does it end?": "8:15 AM",
        "First break starts at 10:05 AM and lasts 15 minutes. What time is the next class?": "10:20 AM",
        "School starts at 9:15 AM. After 4 classes of 45 minutes each, what time is lunch?": "12:15 PM",
        "Breakfast is at 6:45 AM. If lunch is 5 hours 20 minutes later, what time is lunch?": "12:05 PM",
        "Lunch is at 12:10 PM. Dinner comes 6 hours 10 minutes later. What time is dinner?": "6:20 PM",
        "A snack is at 2:30 PM. If the next meal is 4 hours later, what time is it?": "6:30 PM",
        "Dinner is at 6:40 PM. If a snack is 3 hours 25 minutes later, what time is it?": "10:05 PM",
        "School starts at 8:05 AM. After 2 classes and a 10-minute break, what time is it?": "9:55 AM",
        "Assembly at 7:55 AM ends 15 minutes later. What time is it?": "8:10 AM",
        "Breakfast is at 7:10 AM. If lunch is 5 hours 35 minutes later, what time is lunch?": "12:45 PM",
        "Lunch is at 12:25 PM. Dinner comes 6 hours 30 minutes later. What time is dinner?": "6:55 PM",
        "A snack is at 3:05 PM. If the next meal is 4 hours 10 minutes later, what time is it?": "7:15 PM",
        "A train departs at 9:30 AM and travels 3 hours 50 minutes. What time does it arrive?": "1:20 PM",
        "A bus leaves at 7:05 AM and takes 2 hours 45 minutes. What time does it arrive?": "9:50 AM",
        "School starts at 8:20 AM. After 3 classes of 50 minutes each, what time is lunch?": "10:50 AM",
        "Lunch is at 12:15 PM. Dinner comes 6 hours 40 minutes later. What time is dinner?": "6:55 PM",
        "A train departs at 5:50 PM and travels 2 hours 55 minutes. What time does it arrive?": "8:45 PM",
        "A bus leaves at 12:35 PM and drives 3 hours 5 minutes. What time does it arrive?": "3:40 PM",
        "School ends at 3:35 PM. If classes are 45 minutes each with 5-minute breaks, how many classes were there?": "6 classes",
        "A PE lesson starts at 1:20 PM and lasts 50 minutes. End time?": "2:10 PM",
        "A student arrives at school at 7:50 AM and first class starts at 8:00 AM. How long until first break at 10:00 AM?": "2 hours",
        "Morning snack at 10:10 AM lasts 15 minutes. End time?": "10:25 AM",
        "Dinner begins at 7:15 PM and lasts 45 minutes. End time?": "8:00 PM",
        "Breakfast is at 7:05 AM. If lunch is 5 hours 40 minutes later, what time is lunch?": "12:45 PM",
        "Lunch is at 12:15 PM. Dinner comes 6 hours 25 minutes later. What time is dinner?": "6:40 PM",
        "Dinner is at 6:35 PM. If a snack is 3 hours 20 minutes later, what time is it?": "9:55 PM",
        "A train departs at 6:50 AM and travels 3 hours 50 minutes. What time does it arrive?": "10:40 AM",
        "A bus leaves at 8:25 AM and takes 2 hours 35 minutes. What time does it arrive?": "11:00 AM",
        "School starts at 8:10 AM. After 2 classes and a 10-minute break, what time is it?": "9:55 AM",
        "First class starts at 9:15 AM and lasts 50 minutes. When is it over?": "10:05 AM",
        "Breakfast is at 6:45 AM. If lunch is 5 hours 50 minutes later, what time is lunch?": "12:35 PM",
        "A train departs at 5:25 PM and travels 3 hours 15 minutes. What time does it arrive?": "8:40 PM",
        "School starts at 8:05 AM. After 3 classes of 45 minutes each, what time is lunch?": "10:40 AM",
        "Lunch is at 12:20 PM. Dinner comes 6 hours later. What time is dinner?": "6:20 PM",
        "A snack is at 2:35 PM. If the next meal is 4 hours 15 minutes later, what time is it?": "6:50 PM",
        "Dinner is at 6:15 PM. If a snack is 3 hours 25 minutes later, what time is it?": "9:40 PM",
        "Lunch is at 12:10 PM. Dinner comes 6 hours 20 minutes later. What time is dinner?": "6:30 PM",
        "A snack is at 3:00 PM. If the next meal is 3 hours 40 minutes later, what time is it?": "6:40 PM",
        "Breakfast is at 7:00 AM. If lunch is 5 hours 30 minutes later, what time is lunch?": "12:30 PM",
        "Lunch is at 12:15 PM. Dinner comes 6 hours 15 minutes later. What time is dinner?": "6:30 PM",
        "A snack is at 2:40 PM. If the next meal is 4 hours later, what time is it?": "6:40 PM",
        "Dinner is at 6:45 PM. If a snack is 3 hours 20 minutes later, what time is it?": "9:65 PM",
            "A bus departs at 6:10 am and travels for 2 hours 35 minutes to the city center. When does it arrive at its destination?": "8:45 am",
    "A ferry leaves the port at 8:45 am and sails for 1 hour 50 minutes. When does it arrive at its destination?": "10:35 am",
    "A train leaves at 5:30 pm and travels for 3 hours 20 minutes. When does it arrive at its destination?": "8:50 pm",
    "A plane departs at 9:15 am and flies for 2 hours 40 minutes. When does it arrive at its destination?": "11:55 am",
    "A tram leaves the station at 10:25 am and runs for 55 minutes. When does it arrive at its destination?": "11:20 am",
    "A bus leaves at 11:55 am and travels for 2 hours 50 minutes to its destination. When does it arrive at its destination?": "2:45 pm",
    "A ship departs at 2:40 pm and sails for 4 hours 25 minutes. When does it arrive at its destination?": "7:05 pm",
    "A tram leaves at 6:15 am and runs for 1 hour 10 minutes. When does it arrive at its destination?": "7:25 am",
    "A plane departs at 4:50 pm and flies for 3 hours 15 minutes. When does it arrive at its destination?": "8:05 pm",
    "A bus departs at 9:30 am and drives for 2 hours 20 minutes. When does it arrive at its destination?": "11:50 am",
    "A ferry leaves at 11:10 am and sails for 1 hour 45 minutes. When does it arrive at its destination?": "12:55 pm",
    "A train departs at 7:25 pm and travels for 2 hours 50 minutes. When does it arrive at its destination?": "10:15 pm",
    "A tram departs at 5:40 am and runs for 45 minutes. When does it arrive at its destination?": "6:25 am",
    "A ship departs at 8:35 am and sails for 3 hours 55 minutes. When does it arrive at its destination?": "12:30 pm",
    "A bus leaves at 3:20 pm and drives for 1 hour 30 minutes. When does it arrive at its destination?": "4:50 pm",
    "A train departs at 10:05 am and travels for 4 hours 20 minutes. When does it arrive at its destination?": "2:25 pm",
    "A ferry leaves at 12:45 pm and sails for 2 hours 25 minutes. When does it arrive at its destination?": "3:10 pm",
    "A tram departs at 7:50 am and runs for 55 minutes. When does it arrive at its destination?": "8:45 am",
    "A plane departs at 6:30 pm and flies for 5 hours 10 minutes. When does it arrive at its destination?": "11:40 pm",
    "A bus leaves at 1:15 pm and drives for 3 hours 5 minutes. When does it arrive at its destination?": "4:20 pm",
    "A ship departs at 9:00 am and sails for 6 hours 15 minutes. When does it arrive at its destination?": "3:15 pm",
    "A tram departs at 4:25 pm and runs for 40 minutes. When does it arrive at its destination?": "5:05 pm",
    "A train departs at 8:10 am and travels for 2 hours 30 minutes. When does it arrive at its destination?": "10:40 am",
    "A plane departs at 2:55 pm and flies for 1 hour 45 minutes. When does it arrive at its destination?": "4:40 pm",
    "A bus leaves at 11:40 am and drives for 2 hours 55 minutes. When does it arrive at its destination?": "2:35 pm",
    "A ferry departs at 6:05 am and sails for 3 hours 10 minutes. When does it arrive at its destination?": "9:15 am",
    "A ship departs at 3:35 pm and sails for 7 hours 25 minutes. When does it arrive at its destination?": "11:00 pm",
    "A tram leaves at 8:15 am and runs for 1 hour 5 minutes. When does it arrive at its destination?": "9:20 am",
    "A train leaves at 12:20 pm and travels for 3 hours 15 minutes. When does it arrive at its destination?": "3:35 pm",
    "A bus departs at 5:45 pm and drives for 1 hour 40 minutes. When does it arrive at its destination?": "7:25 pm",
    "Your morning meeting starts at 9:00 am and lasts for 1 hour 15 minutes. When does it finish?": "10:15 am",
    "Your conference call begins at 2:30 pm and runs for 50 minutes. When does it finish?": "3:20 pm",
    "The workshop starts at 11:45 am and goes for 2 hours 20 minutes. When does it finish?": "2:05 pm",
    "Your office shift begins at 8:00 am and runs for 7 hours 30 minutes. When does it end?": "3:30 pm",
    "Your team briefing begins at 4:10 pm and lasts 40 minutes. When does it finish?": "4:50 pm",
    "The client meeting starts at 10:30 am and goes for 1 hour 10 minutes. When does it end?": "11:40 am",
    "Your interview starts at 3:20 pm and lasts 35 minutes. When does it end?": "3:55 pm",
    "Your training session starts at 1:15 pm and continues for 2 hours 45 minutes. When does it end?": "4:00 pm",
    "The project presentation begins at 9:50 am and runs for 55 minutes. When does it end?": "10:45 am",
    "The review session starts at 11:25 am and continues for 1 hour 20 minutes. When does it end?": "12:45 pm",
    "Your department meeting begins at 7:45 am and runs for 1 hour 35 minutes. When does it finish?": "9:20 am",
    "The strategy session starts at 5:00 pm and continues for 2 hours 10 minutes. When does it end?": "7:10 pm",
    "The seminar begins at 8:30 am and lasts 3 hours 15 minutes. When does it finish?": "11:45 am",
    "The lecture starts at 10:15 am and runs for 1 hour 50 minutes. When does it finish?": "12:05 pm",
    "Your school assembly begins at 8:20 am and goes for 40 minutes. When does it end?": "9:00 am",
    "The history class starts at 9:10 am and lasts 55 minutes. When does it end?": "10:05 am",
    "The math exam begins at 1:00 pm and goes for 2 hours 30 minutes. When does it finish?": "3:30 pm",
    "Your science lab starts at 11:30 am and runs for 1 hour 25 minutes. When does it finish?": "12:55 pm",
    "The English test begins at 2:15 pm and lasts 1 hour 45 minutes. When does it finish?": "4:00 pm",
    "The school trip leaves at 7:00 am and lasts 6 hours 30 minutes. When do students return?": "1:30 pm",
    "The art class starts at 3:25 pm and lasts 1 hour 10 minutes. When does it end?": "4:35 pm",
    "The physics lecture begins at 10:40 am and continues for 2 hours. When does it finish?": "12:40 pm",
    "The group study starts at 4:00 pm and lasts 1 hour 50 minutes. When does it end?": "5:50 pm",
    "The geography lesson starts at 8:50 am and goes for 45 minutes. When does it finish?": "9:35 am",
    "Your school sports practice begins at 5:15 pm and runs for 1 hour 30 minutes. When does it end?": "6:45 pm",
    "Your literature class begins at 12:05 pm and goes for 1 hour 40 minutes. When does it end?": "1:45 pm",
    "Your chemistry practical starts at 9:35 am and lasts 2 hours 10 minutes. When does it end?": "11:45 am",
    "Breakfast starts at 7:30 am and takes 25 minutes. When do you finish eating?": "7:55 am",
    "Lunch begins at 12:45 pm and lasts 40 minutes. When do you finish eating?": "1:25 pm",
    "Dinner starts at 6:20 pm and takes 1 hour 10 minutes. When do you finish eating?": "7:30 pm",
    "Your coffee break begins at 10:15 am and lasts 20 minutes. When does it finish?": "10:35 am",
    "Your snack time begins at 4:05 pm and goes for 15 minutes. When does it finish?": "4:20 pm",
    "Your cooking starts at 5:40 pm and takes 50 minutes. When will the meal be ready?": "6:30 pm",
    "Your baking begins at 2:10 pm and takes 1 hour 30 minutes. When will the cake be ready?": "3:40 pm",
    "Your lunch with friends starts at 1:35 pm and lasts 1 hour 25 minutes. When does it finish?": "3:00 pm",
    "Your family dinner starts at 7:10 pm and continues for 1 hour 35 minutes. When does it finish?": "8:45 pm",
    "Your tea break begins at 3:25 pm and goes for 30 minutes. When does it end?": "3:55 pm",
    "Your breakfast cooking starts at 6:50 am and takes 35 minutes. When will breakfast be ready?": "7:25 am",
    "Your evening snack begins at 8:20 pm and lasts 20 minutes. When does it end?": "8:40 pm",
    "Your lunch break at school starts at 12:15 pm and goes for 50 minutes. When does it finish?": "1:05 pm",
    "Your office lunch break starts at 1:00 pm and lasts 45 minutes. When does it finish?": "1:45 pm",
    "Your brunch with family starts at 10:40 am and goes for 1 hour 20 minutes. When does it finish?": "12:00 pm",
    "Your cooking dinner begins at 5:15 pm and takes 1 hour. When will it be ready?": "6:15 pm",
    "Your picnic lunch begins at 11:20 am and lasts 2 hours. When does it end?": "1:20 pm",
    "Your coffee time begins at 9:35 am and lasts 25 minutes. When does it finish?": "10:00 am",
    "Your lunch preparation starts at 12:05 pm and takes 55 minutes. When will lunch be ready?": "1:00 pm",
    "Your office breakfast meeting begins at 8:15 am and continues for 1 hour 10 minutes. When does it end?": "9:25 am",
    "Your study group dinner begins at 6:45 pm and lasts 1 hour 15 minutes. When does it end?": "8:00 pm",
    "Your midnight snack begins at 11:50 pm and takes 20 minutes. When does it end?": "12:10 am",
        "A ferry leaves at 9:20 am and sails for 2 hours 40 minutes. When does it arrive at its destination?": "12:00 pm",
    "A tram departs at 4:45 pm and runs for 50 minutes. When does it arrive at its destination?": "5:35 pm",
    "Your team workshop begins at 11:00 am and runs for 2 hours 15 minutes. When does it end?": "1:15 pm",
    "A train departs at 7:55 am and travels for 3 hours 40 minutes. When does it arrive at its destination?": "11:35 am",
    "Your evening class begins at 6:10 pm and lasts for 1 hour 20 minutes. When does it finish?": "7:30 pm",
    "A ship sails at 10:25 am and journeys for 5 hours 5 minutes. When does it arrive at its destination?": "3:30 pm",
    "Your study group meets at 2:15 pm and continues for 1 hour 45 minutes. When does it end?": "4:00 pm",
    "Lunch begins at 1:05 pm and lasts for 55 minutes. When are you done eating?": "2:00 pm",
    "A bus leaves at 5:35 am and drives for 2 hours 25 minutes. When does it arrive at its destination?": "8:00 am",
    "Your office hours start at 9:10 am and last for 3 hours. When do they end?": "12:10 pm",
    "A flight departs at 11:45 pm and flies for 6 hours 30 minutes. When does it arrive at its destination?": "6:15 am",
    "Your exam begins at 10:40 am and is scheduled for 2 hours 10 minutes. When does it finish?": "12:50 pm",
    "Dinner starts at 7:25 pm and takes 1 hour 15 minutes. When do you finish eating?": "8:40 pm",
    "A train leaves at 3:30 pm and travels for 1 hour 50 minutes. When does it arrive at its destination?": "5:20 pm",
    "Your project review starts at 8:20 am and goes on for 2 hours 40 minutes. When does it finish?": "11:00 am",
    "A ferry departs at 12:15 pm and sails for 4 hours 45 minutes. When does it arrive at its destination?": "5:00 pm",
    "Your morning lecture begins at 9:35 am and lasts for 1 hour 25 minutes. When does it end?": "11:00 am",
    "Breakfast begins at 6:50 am and takes 30 minutes. When are you done eating?": "7:20 am",
    "A bus departs at 2:55 pm and drives for 3 hours 5 minutes. When does it arrive at its destination?": "6:00 pm",
    "Your meeting starts at 4:15 pm and lasts for 1 hour 10 minutes. When does it end?": "5:25 pm",
    "A tram leaves at 10:05 am and runs for 35 minutes. When does it arrive at its destination?": "10:40 am",
    "Your seminar begins at 1:25 pm and continues for 2 hours 5 minutes. When does it finish?": "3:30 pm",
    "A ship departs at 7:40 am and sails for 7 hours 20 minutes. When does it arrive at its destination?": "3:00 pm",
    "Your team call begins at 3:10 pm and takes 50 minutes. When does it end?": "4:00 pm",
    "Dinner starts at 8:05 pm and lasts for 40 minutes. When are you done eating?": "8:45 pm",
    "A plane departs at 5:55 am and flies for 2 hours 50 minutes. When does it arrive at its destination?": "8:45 am",
    "Your class begins at 11:20 am and goes on for 1 hour 30 minutes. When does it finish?": "12:50 pm",
    "A bus departs at 6:15 pm and drives for 4 hours 20 minutes. When does it arrive at its destination?": "10:35 pm",
    "Your exam starts at 2:35 pm and lasts for 2 hours 25 minutes. When does it finish?": "5:00 pm",
    "Lunch begins at 12:10 pm and takes 1 hour 5 minutes. When are you done eating?": "1:15 pm",
    "A ferry departs at 9:45 am and sails for 3 hours 15 minutes. When does it arrive at its destination?": "1:00 pm",
    "Your weekly meeting starts at 10:50 am and continues for 1 hour 40 minutes. When does it end?": "12:30 pm",
    "A train departs at 1:15 pm and travels for 5 hours 30 minutes. When does it arrive at its destination?": "6:45 pm",
    "Your office hours begin at 8:25 am and last for 2 hours 35 minutes. When do they end?": "11:00 am",
    "Breakfast starts at 7:10 am and takes 25 minutes. When are you done eating?": "7:35 am",
    "A ship departs at 11:35 am and sails for 8 hours 10 minutes. When does it arrive at its destination?": "7:45 pm",
    "Your study session begins at 3:25 pm and lasts for 2 hours 15 minutes. When does it finish?": "5:40 pm",
    "A tram departs at 6:40 pm and runs for 1 hour 5 minutes. When does it arrive at its destination?": "7:45 pm",
    "Your group project meeting begins at 9:30 am and lasts for 1 hour 50 minutes. When does it end?": "11:20 am",
    "A bus departs at 4:05 pm and drives for 2 hours 55 minutes. When does it arrive at its destination?": "7:00 pm",
    "Your evening lecture begins at 5:20 pm and continues for 2 hours 40 minutes. When does it end?": "8:00 pm",
    "A plane departs at 10:10 am and flies for 1 hour 50 minutes. When does it arrive at its destination?": "12:00 pm",
    "Your morning class starts at 8:45 am and goes on for 1 hour 35 minutes. When does it finish?": "10:20 am",
    "Dinner begins at 6:55 pm and lasts for 50 minutes. When are you done eating?": "7:45 pm",
    "A ferry departs at 1:05 pm and sails for 6 hours 55 minutes. When does it arrive at its destination?": "8:00 pm",
     "Your history lecture begins at 2:20 pm and lasts for 1 hour 40 minutes. When does it finish?": "4:00 pm",
    "Breakfast starts at 8:15 am and takes 45 minutes. When are you done eating?": "9:00 am"
    },
  "arithmetic": {
    "(1-12)*5*10": -550,
    "(120/15-10)*(19-14)": -10,
    "-7+4+10*5": 47,
    "-10-1-(11*20+3)": -234,
    "-20/2*9+60/15*5": -70,
    "11*9-6-(17+14)": 62,
    "(-11+15)*4+180/20": 25,
    "9/3*(-17-8)": -75,
    "-1*15-(-8-6+8)": -9,
    "(-16-7)*(-2+9-8)": 23,
    "(11-9-6)*(-2+9-8)": 4,
    "4*10*4-(19+15)": 126,
    "(-19-20)*(12+12-9)": -585,
    "-17-8+(-9+3)*2": -37,
    "10+16-10-(-7+4)": 19,
    "55/11+(8*2+10)": 31,
    "140/20+7-180/20": 5,
    "(-7-11)*(8*2+10)": -468,
    "-78/13*(4*10*4)": -960,
    "-17-8-(102/17-4)": -27,
    "5*10-13*20": -210,
    "-14/14+5*10": 49,
    "120/15-10+(-4-20)": -26,
    "(200/20-2)*(2-13+6)": -40,
    "(-9+3)*2-(-19-16)": 23,
    "8*2+10+(-4+3)*5": 21,
    "-19+1-18*4": -90,
    "-10-1/20*10": -10,
    "-18-14+(-5+2)*7": -53,
    "11*12-11*3*9": -165,
    "-84/12*6+(-7+16)": -33,
    "2-13+6-(-14+7)": 2,
    "90/15+(-10-8-3)": -15,
    "1-12-(8*2+10)": -37,
    "12*8+4-(20/5+1)": 95,
    "6*6+(120/15+9)": 53,
    "10*5+3*12": 86,
    "(-5+2)*7*(6*6)": -756,
    "9/3+(-6*13+7)": -68,
    "-16+19+(-7+4)": 0,
    "10*5+6*6": 86,
    "55/11+3*9": 32,
    "20+12-20/2*9": -58,
    "(-18-14)/(10+16-10)": -2,
    "-4-20+(11*20+3)": 199,
    "-17+19+78/13": 8,
    "(-9+3)*2-11*3*9": -309,
    "-20+17-2+4*10*4": 155,
    "-19-6+(-4*10-8)": -73,
    "-110/11*4-(13*8+5)": -149,
    "(-8-17+6)*(-7+16)": -171,
    "20+12-9/3": 29,
    "(10+16-10)/(-14/14)": -16,
    "17+13-4-84/12*6": -16,
    "11-10+(35/7+10)": 16,
    "140/20+7+10*5": 64,
    "9/3+(11*9-6)": 96,
    "-24/12+(7*7-9)": 38,
    "-14-3-3-(-6*13+7)": 51,
    "-78/13-(-4+3)*5": -1,
    "(20/5+1)*((-5+2)*7)": -105,
    "(-5+2)*7+(-14+7)": -28,
    "-19*12-15*20": -528,
    "-19-(11*9-6)": -112,
    "66/11+(20+12)": 38,
    "(-6*13+7)*((-4+3)*5)": 355,
    "120/15-10-(-9+3)*2": 10,
    "17+13-4-90/15": 20,
    "(-16-7)/(3-2)": -23,
    "-14+7+(-8-17+6)": -26,
    "(-2+9-8)*(-14-3-3)": 20,
    "16*7-11*3*9": -185,
    "-19-6+(-8+5)*8": -49,
    "9/3-(35/7+10)": -12,
    "20*9-(2-13+6)": 185,
    "(-7-11)*(17+14)": -558,
    "-78/13+19*12": 222,
    "180/20+55/11": 14,
    "-4*10-8-(20+12)": -80,
    "60/15*5+(7*7-9)": 60,
    "-24/12*(12*8+4)": -200,
    "0/20*10/(-24/3*4)": 0,
    "-1*15*(-6*13+7)": 1065,
    "14-7-5-(-6*13+7)": 73,
    "-10-20+18*4": 42,
    "-14+7+18*4": 65,
    "(-14+7)*(60/15*5)": -140,
    "-19*12-(-7+16)": -237,
    "12+12-9+(35/7+10)": 30,
    "11*12+84/12*6": 174,
    "90/15*5*(66/11)": 180,
    "(-19-20)*(-16+19)": -117,
    "60/15*5-11*12": -112,
    "10*5-(3-2)": 49,
    "-3*2*(-14-3-3)": 120,
    "-17-8+3*9": 2,
    "-3*12-(19-14)": -41,
    "(16-12)*(4*10*4)": 640,
    "-24/12+13*20": 258,
    "8*2+10-19*12": -202,
    "(-10-7)*(3+8)": -187,
    "3+10*(-10-4)": -137,
    "15+5-9-50/5": 1,
    "10-9+3*6": 19,
    "-6+2-35/7": -9,
    "27/3-3*8": -15,
    "4/4-(-9-7)-6": 11,
    "17-4+(5+2)": 20,
    "15*5-5+9": 79,
    "12/3+25/5+6": 15,
    "(1-10)*2*8+4": -140,
    "(-2+6)*9/(0-6)": -6,
    "16/2+7-(20+5)": -10,
    "4+2+(6+1)": 13,
    "16+9-2+(11+8)-5": 37,
    "(10-10)*(20-1)": 0,
    "20*3-6*8*4": -132,
    "20*5+(-1+8)": 107,
    "-4-5+(18-3)+7": 13,
    "14-5-(3+8)": -2,
    "27/3+(11-3)+4": 21,
    "-6-10+9-9*7": -70,
    "9*7-48/6+5": 60,
    "-5+7+(18+4)": 24,
    "-10*3*3*(9-10)": 90,
    "-10*9+4*9+7": -47,
    "8*9-(12-10)+10": 80,
    "-7*7-20/10": -51,
    "3+8-19*6-4": -107,
    "9*7-10*6": 3,
    "(14-7)*3+(16-3)-8": 26,
    "2*5*12/3": 40,
    "16/4*10/(0-1)+2": -38,
    "16/2-2*-21/3": 22,
    "-2+6-10-15*5": -81,
    "(4+2)*8/7*4-4": 23,
    "-10*2-7-(-1+9)": -35,
    "-5*(-2+7)": -25,
    "-9*4+10-3*9": -53,
    "-3*2*(-4-1)": 30,
    "3/3+2": 3,
    "-8/8*-28/4": 7,
    "32/4-(3+10)": -5,
    "-8*3/-27/9-5": -4,
    "20+9+5/-20/10": 28,
    "-7*10*(7-9)": 140,
    "(13+5)*5-64/8-9": 73,
    "42/6-3*2": 1,
    "6/6*4*(6-8)": -8,
    "12/3+6*3/3": 10,
    "(10-9)*(17+6)": 23,
    "(1+10)*(-4-1)": -55,
    "12-8+(2-4)+4": 6,
    "20+3+5-13*3-6": -17,
    "(11-8)*(-3+7)": 12,
    "9-1-10+(8+10)": 16,
    "14/2+9*9": 88,
    "-8-5+20*4+5": 72,
    "14/2+(4-1)": 10,
    "-3-(-4+2)": -1,
    "0/4*-18/9*9": 0,
    "18*8+5-(6+6)*7": 65,
    "-10*3*3-72/8*4": -126,
    "11+8-(17-3)*8": -93,
    "18+10+(16+7)-4": 47,
    "-4*2+3*2": -2,
    "-7-7+(-4-2)-5": -25,
    "20*4+(4-3)": 81,
    "8-7*(1+5)": -34,
    "(-4+5)*-32/8+5": 1,
    "-8*8+(18+4)": -42,
    "12*7-2*5+7": 81,
    "-5*5-4+6-6": -29,
    "-6-10+9+9*5-2": 36,
    "-24/6+(-10+1)+10": -3,
    "12-4-6*(-8-5)*2": 164,
    "-7-7+10/5": -12,
    "1+10-10*2-7": -16,
    "(-10-6)/-20/5": 0,
    "-2/2+5*8": 39,
    "2*5-1-4": 5,
    "-4-2-5-(3+10)": -24,
    "-5+10-5+5*9-7": 38,
    "(16+6)*7-15*5": 79,
    "-3-7+9-(11+2)": -14,
    "20*5-(-3+9)+6": 100,
    "17*9-(5+1)-2": 145,
    "7*6+9*4": 78,
    "-6*5+(6+1)": -23,
    "(1-7)*9+(3+6)": -45,
    "63/9*5-20*10": -165,
    "-8*0/9+3": 3,
    "12/2+(0-4)*5": -14,
    "(0-10)*-9": 90,
    "(0-7)*2+12/3+6": -4,
    "-1+9+(2-8)-9": -7,
    "15*2*3-(-3+7)": 86,
    "9+5+6+(15-1)*3": 62,
    "8+10-11*3+6": -9,
    "(-6+4)*10*(7-3)+6": -74,
    "-18/9*9+(16-4)": -6,
    "(-5-5)*9+(-2+7)": -85,
    "2*3-6*10": -54,
    "50/5+54/6": 19,
    "8-7+(0+8)": 9,
    "19+4+6": 29,
    "5-2*8+4": -7,
    "32/8-4-(-4+2)": 2,
    "-5*8*3-(-6+4)*10": -100,
    "(-7-7)*(-1+8)": -98,
    "7-2-15*6": -85,
    "-4*2*8-9/9": -65,
    "-8-9+(-10+10)": -17,
    "(4-2)*3+16/2+3": 17,
    "-8*10+9+20/5": -67,
    "-5+8+9-(18+4)": -10,
    "-2/2+18*7": 125,
    "8-9*-10*6": 548,
    "12-9+7-(-5-3)-7": 11,
    "3*4*9+9*4+10": 154,
    "20*5+(11+8)-5": 114,
    "-3*5-13*3-6": -60,
    "4*7+9/4": 30,
    "-5-6-6+9*6": 37,
    "2*3-6-(-10+1)+7": 16,
    "8+2+4-5*8": -26,
    "(16+2)*7+(8+5)-9": 130,
    "-5+8+9/(8-4)": 5,
    "(10+1)*6": 66,
    "-10-3-8*9": -85,
    "12+9+7-(-2+6)*9": -8,
    "7*4/(19-3)-9": -7,
    "14-1-3-(17-6)*9": -89,
    "(3+6)*2/-10/10": 0,
    "16-3-8*(6+8)-6": -105,
    "19-4+2*3+2": 23,
    "0/4+(-9-5)": -14,
    "-1*4-7*(0-6)": 38,
    "3/(1-6)+4": 3,
    "9/9*(20+3)+5": 28,
    "-5*(18-2)": -80,
    "(-3+8)*(19+5)": 120,
    "9/9-30/3": -9,
    "-2-4-3": -9,
    "12*9-3": 105,
    "20-7/9+3": 22,
    "(5+2)/(10-9)": 7,
    "-4*2-8+(0+7)": -9,
    "-50/10+14*5": 65,
    "(12-5)*8+(16-9)": 63,
    "15*4/(-4-1)": -12,
    "10-9+(17-1)-9": 8,
    "(-5+10)*54/9": 30,
    "-5+8+9+(13+2)": 27,
    "13-6-20*5": -93,
    "(0+5)*5-(16-4)": 13,
    "7-9+(-2+7)": 3,
    "20-7-(10+1)": 2,
    "(-10-3)*6+12/3": -74,
    "-2-8-5*8/4-3": -23,
    "(0+3)*(16-4)": 36,
    "-4-7-(3+4)": -18,
    "2+80/8+2": 14,
    "20*7+4+18/2": 153,
    "15-7+(20-2)": 26,
    "5*5-(0+9)-10": 6,
    "(1-6)*3+(16+7)*6": 123,
    "(11-4)*2-9": 5,
    "8+8-49/7*6": -26,
    "15*3-(17-6)*9": -54,
    "0/4/3*4*9": 0,
    "16/4*10-(3+8)": 29,
    "-10-7-(9+5)+6": -25,
    "16/2-2*-27/9": 14,
    "10*10-3*4*9": -8,
    "-3*6/3": -6,
    "-1-3-3*(-5+5)+8": 4,
    "18-(-8-10)": 36,
    "-3*2-(-6-10)": 10,
    "-21/3-(5-3)": -9,
    "(-3+6)*(11+8)": 57,
    "(-5-10)*(9-6)+5": -40,
    "-9-2-(6+8)": -25,
    "10-(18+8)": -16,
    "-20/2+(16-5)": 1,
    "(1+10)*(9-5)": 44,
    "7-6+2+(0-2)-7": -6,
    "-45/5-10-(-7+10)*7": -40,
    "-10/10*(-1+1)*8": 0,
    "18+8-9*4+10": 0,
    "20-7-(5-7)": 15,
    "17-4+7*8": 69,
    "13-1+(-6+7)*3": 15,
    "7-2+(6+6)": 17,
    "18+3-10/10": 20,
    "0+5-(7-10)": 8,
    "-9+6+4*(14+1)": 57,
    "50/5-(7-4)*9": -17,
    "-7+5+7+(15+2)+2": 24,
    "20/2*5-20*7+4": -86,
    "-5-10-(4+8)*2": -39,
    "-1*2*5+28/4": -3,
    "(-3+3)/(3+10)": 0,
    "6+8-6-(-6-10)+9": 33,
    "15+4-7*6-5": -28,
    "-6*(18+3)": -126,
    "27/9*(9-10)": -3,
    "-5*8-(14-1)-3": -56,
    "3-5-(-4-5)": 7,
    "19+1+16/4-6": 18,
    "0+7+(3+10)": 20,
    "4*9+7+70/7": 53,
    "18-5+5*10": 63,
    "5-3-4+16/2+3": 9,
    "12-6+(16+9)*2": 56,
    "(16+2)*7+25/5+5": 136,
    "(13+5)*5+15/3": 95,
    "(7-4)*9-9*7": -36,
    "12/6-(-9-2)": 13,
    "-6+2-(-10-7)": 13,
    "-36/6*(10+7)": -102,
    "20*7*8/63/9*5": 9,
    "16+10-(6+8)-6": 6,
    "16/2+3+4*9": 47,
    "-10+5*-3*4": -70,
    "18*5*10/-9": -100,
    "13+6+18/3": 25,
    "(18-5)*(6+8)-6": 176,
    "-36/9*9+(15-4)-8": -33,
    "13*9-(7-2)": 112,
    "-18/9+4-2": 0,
    "18*5*3/(7-2)": 54,
    "13-1-15*2*3": -78,
    "-2*6*35/7+2": -58,
    "14+3-(8-4)": 13,
    "(4+2)*8-5*9": 3,
    "16/4*10+(3-7)": 36,
    "(-7+10)*7-(3+8)": 10,
    "-2+4-36/6*8": -46,
    "12+8+5-(12+9)+7": 11,
    "19*6-4-18*7": -16,
    "-7+6+(-10-3)*9": -118,
    "4+2+2*3": 12,
    "16/2-2*32/4": -8,
    "13-7-6-(18+4)": -22,
    "5+7+(-2+4)": 14,
    "6+1+(-5-3)-7": -8,
    "21/3+7*2": 21,
    "(0-10)/30/6-10": -10,
    "2-3-8+56/7*10": 71,
    "-32/8+2*(7-2)": 6,
    "10+6+5/-27/9": 15,
    "10-6+(2-2)": 4,
    "-21/3*(16-9)": -49,
    "(13+10)*6+(0-6)": 132,
    "-3-3+10-21/3+6": 3,
    "-10*2+7+(12+8)+5": 12,
    "-10+1+10+10*4-9": 32,
    "18*5*3/24/8": 1,
    "(4+8)*2-20*5": -76,
    "36/6*8+16/4*4": 64,
    "-20/5-(0-4)*5": 16,
    "2*3-6/(-3-3)": 7,
    "17-1-9-(0-4)*5": 27,
    "-36/9*6+11*3+6": 15,
    "7-9+13*2": 24,
    "17*4+8*-2/2": 60,
    "8/4+11*9": 101,
    "13*4-20*10": -148,
    "-6-10-(17-3)*8": -128,
    "8*2-5+(19+5)": 35,
    "17*6-(16+5)": 81,
    "17-1-9+(2-8)-9": -8,
    "18+10+4+2": 34,
    "-5-6-6-(1+5)": -23,
    "17-5-27/9": 9,
    "15+4-(-2-8)-5": 24,
    "(1-10)*6-6": -60,
    "27/9+3+11*5+8": 69,
    "2-8-9-45/9": -20,
    "9*8+4": 76,
    "5/5-(-2+7)": -4,
    "(7-2)*(20-5)": 75,
    "-9+56/7*10": 71,
    "-8-8+(18-5)": -3,
    "-7+1+2*12/3+6": 8,
    "13-6+(10-7)+6": 16,
    "-40/4-27/3": -19,
    "-5*5+(2+2)": -21,
    "49/7-2-(-8+7)": 6,
    "6-8+6*3": 16,
    "-4*2-8-(-5+6)": -17,
    "-5-3-7-(19-3)-9": -40,
    "8-4+(13+10)*6": 142,
    "5+9-(3+7)": 4,
    "4-3-63/9-5": -11,
    "16-4+(17-3)*8": 124,
    "(-5+6)*100/10*4": 40,
    "-24/6-(1+5)": -10,
    "-20/2*(-3+8)": -50,
    "3-7+8*10+9": 85,
    "-5*6+2+1*5+9": -14,
    "63/9-3*6": -11,
    "4+1-(19+8)": -22,
    "(-3-4)/(-5+6)": -7,
    "18*7+(-7-7)": 112,
    "-4*2*8-27/3*2": -82,
    "-3*8+(-1-9)": -34,
    "-16/4*4+3*6": 2,
    "(18+4)/(18+4)": 1,
    "16+6+2-(18+3)": 3,
    "(16+2)*7-8-9": 109,
    "9-10-(-4+5)": -2,
    "14*2+(17-5)": 40,
    "-2-8-5-(-9+5)*2": -7,
    "14+5-6*3+10": 11,
    "-8*8+6-(19-4)+7": -66,
    "12/3+6*36/6": 40,
    "-10*2-7+24/4": -21,
    "-9+9-3-(-3-3)": 3,
    "(-2-1)*-2*7": 42,
    "9-1-10*(16+5)": -202,
    "-10*3*3+10*4": -50,
    "7-3+6*(0+8)": 52,
    "8+10-(0-4)*5": 38,
    "-7*8+2*8*4": 8,
    "(3-1)*9+12/3": 22,
    "20+15*7-2": 123,
    "-5+5+8*28/4+7": 63,
    "-2*2-7+6": -5,
    "-2-8-5+20*4": 65,
    "(2-10)*(11+2)": -104,
    "10-7+6+(-7-8)": -6,
    "3-(7-5)": 1,
    "-3*8+20/2-5": -19,
    "9-10-(3-3)": -1,
    "-28/4-(13+6)": -26,
    "(6-5)*(6+4)": 10,
    "(0+5)*5-(12-4)-6": 11,
    "18+8+(0+5)*5": 51,
    "1-10-(8+9)": -26,
    "14+9-4*3": 11,
    "60/10+17*6": 108,
    "-18/3-7-(5-1)-7": -24,
    "(18+10)*(-8+7)": -28,
    "(-1+1)*8/(-6+9)": 0,
    "11*3+6-60/10": 33,
    "15-4-9+(-3-4)": -5,
    "14*2*16/2-2": 222,
    "(-10+8)*4*(-2-8)": 80,
    "8+2+4-5+7": 16,
    "-10+7-(6+8)": -17,
    "2*10+10+(3-1)*9": 48,
    "(11+4)*2-(4+2)*8": -18,
    "100/10*4+(6+8)": 54,
    "-2+4-25/5+6": 3,
    "36/6*8+(0-2)-7": 39,
    "(16-10)*5-12*7": -54,
    "-8/4-3-(2+2)": -9,
    "3+10+(-10+9)": 12,
    "9*7+(-2-8)": 53,
    "-4*2*8+17*4+8": 12,
    "16-3*8": -8,
    "-10+7-11*3+6": -30,
    "6+8-11*3+6": -13,
    "5*5-7*2": 11,
    "-21/3+6*(-7+4)*3": -61,
    "(0-4)*5+(4+10)": -6,
    "4+3-2-(10-6)": 1,
    "49/7-2+(20+5)": 30,
    "12/3*(18+1)": 76,
    "2*5*(15+2)+2": 172,
    "-8+5-10+(14-7)*3": 8,
    "-1*7-5-(19+4)+10": -25,
    "-10+8-(7+7)": -16,
    "(7-7)/4*6": 0,
    "7-10+1*10*2": 17,
    "(18+4)*4+2": 90,
    "4-2+80/8+2": 14,
    "5*6+9*2": 48,
    "-8-4-4+5+7": -4,
    "0*4-5-(-10-3)*9": 112,
    "12/3+6-(7-10)": 13,
    "(18+4)*(0+9)-10": 188,
    "2+10+(13-3)": 22,
    "1-4-(-10-7)": 14,
    "-2*7-(1+10)": -25,
    "5-3-4+3*2": 4,
    "-10+1+7*90/9": 61,
    "(1+10)*8+(13-7)-6": 88,
    "-10*3+10*2": -10,
    "-16/4-10-40/5+4": -18,
    "9*7+(18+3)+6": 90,
    "6/2-4+(-9-3)": -13,
    "27/3*(-6-4)-10": -100,
    "-18/9*-56/7+3": 19,
    "(-5+10)*15/5+8": 23,
    "28/4*8+(19+8)": 83,
    "19*9+2*3": 177,
    "11+8-5-10*2-8": -14,
    "(6+6)*7-(0-6)": 90,
    "13+4+8-17*9": -128,
    "50/5-(11-3)+4": 6,
    "19+4+10+20/4": 38,
    "(10-7)*(-7-7)": -42,
    "(5-7)*10*-9": 180,
    "2-8-9+(13+6)": 4,
    "-3*6*6/6*4": -72,
    "6/2-4+30/3": 9,
    "(5-7)*6-24/3*9": -84,
    "-2*7+4*10-5": 21,
    "16+5-5+9": 25,
    "-18/9+(-7-7)": -16,
    "32/8-4-(-2-8)": 10,
    "4*2-3*(16-3)": -31,
    "(17-6)*9-12/2": 93,
    "-8*8+6+56/7*10": 22,
    "1-8-(-7-8)": 8,
    "-40/4-(11+8)": -29,
    "10+2+4*8+7": 51,
    "18+3+6/(-6+7)*3": 39,
    "7*2*(-6+8)": 28,
    "-5*5*(-10+3)": 175,
    "-21/7+15*9": 132,
    "11*8*6/36/6": 2,
    "-5*8+2*6": -28,
    "-3*4-20*4-4": -96,
    "18*5-7-(-1+9)": 75,
    "11+8-8-9": 2,
    "(3-1)*9-(11-3)+4": 14,
    "14-3-7/(-9+6)+4": 17,
    "(11+4)*2-4*2-3": 19,
    "(12-5)*8+(-9-4)*10": -74,
    "12+8+5-4*2*8": -39,
    "13*4-40/5+4": 48,
    "-45/9*4-(15+2)+2": -35,
    "19+4+10*-18/9": 3,
    "(3-9)*(4+2)": -36,
    "8/2+9-(15-4)-9": -7,
    "11+8+7*10": 89,
    "72/8-9+(4-2)": 2,
    "-4*7+(0-9)": -37,
    "17*6-(-3+8)": 97,
    "2+2-4*7+9": -15,
    "-4-7+(20+5)": 14,
    "0/9+3-(0-10)*4": 43,
    "24/8-19*6-4": -115,
    "-6-2+5*6*3": 82,
    "-8*2-(-6-10)": 0,
    "10*4*-10/2": -200,
    "(1+10)*8+(17-4)": 101,
    "2-3+7/(7-9)": -4,
    "-5*5*(-5+10)": -125,
    "0*5*(0+9)": 0,
    "(-9+9)*10+(6+8)": 14,
    "17+1-63/9-5": 6,
    "72/8-9/-2*7": 40,
    "12-8-12*9": -104,
    "(-8-5)*2+70/10": -19,
    "-8*10+7-8/4": -75,
    "6+8+(18+4)": 36,
    "14-6+4*2-8": 8,
    "6+3-36/6*8": -39,
    "(1+9)*7-48/8+10": 74,
    "-6+9-4*7+9": -16,
    "13*9-(5+1)-2": 109,
    "20+3+5-40/5*7": -28,
    "(-1+9)/(10-9)": 8,
    "-2+6+7*6-6": 40,
    "-48/8*(10-10)": 0,
    "5/5+3*4": 13,
    "(0-7)*2+30/10-2": -13,
    "7-3+6*(-10-3)": -74,
    "9-10-18/9*9": -19,
    "-9+6+4-(13+2)": -14,
    "9*7+18/3": 69,
    "-40/4+9*8+4": 66,
    "2*5+7*2-8": 16,
    "-3+18*5-7": 80,
    "1-1-(-1+1)*8": 0,
    "7-6+2-(6+8)-6": -17,
    "6+4-9/9-7": 2,
    "-28/7-5*(0+5)": -29,
    "(1+10)*8/12/3": 2,
    "1+4+4-20*10": -191,
    "-6-6-8+16/4-6": -22,
    "(18-10)*2+35/7-9": 12,
    "-9*3*5+(1-7)*9": -189,
    "13+6+(2+7)": 28,
    "21/3-2*3-6": -5,
    "21/7+(7+4)": 14,
    "-2+6+7*-20/10": -10,
    "16+3+(7-3)+6": 29,
    "2+10-13*8": -92,
    "4+2-5": 1,
    "25/5*50/5": 50,
    "-36/6+(0+5)": -1,
    "19*9+12/6": 173,
    "12+1+(10+2)": 25,
    "8*9+(-6-6)-8": 52,
    "20/2*5+24/4": 56,
    "(8+8)*-6": -96,
    "20*3-9+9*5-6": 90,
    "0-6-49/7-2": -15,
    "-1*4-7-(20-7)": -24,
    "18+5-3*6-3": 2,
    "14/2*(12+9)+7": 154,
    "1+3-6+3": 1,
    "9+5+6-21/7": 17,
    "(14-7)*3*(-1+6)": 105,
    "-7*2+27/3": -5,
    "16+8-8+(-2-1)": 13,
    "(-7-6)*6+(18+5)": -55,
    "20-2-(-8-4)": 30,
    "2*8*4*(-2-1)": -192,
    "11*3+6-63/9": 32,
    "15*4-16/4*2": 52,
    "-1*10*2+(0+5)*5": 5,
    "1-6+4-(9-10)": 0,
    "(1-1)*(-8+8)-6": -6,
    "3*3-5*63/9": -26,
    "1-4-(13+5)*5": -93,
    "(3+6)*2+(-6+7)*3": 21,
    "15+5-9-2*10+10": 1,
    "(0+8)*4*2-3": 61,
    "8*9-(1-10)": 81,
    "19-4+7*(12-7)": 50,
    "12/3+6+(3+8)": 21,
    "63/9*5*(10-9)": 35,
    "8-9-4": -5,
    "(-8-8)*(7-5)": -32,
    "15*5+(20+8)": 103,
    "100/10*4+(-10-3)*9": -77,
    "16-8+7*(-6+2)": -20,
    "3/3*9-16*8-5": -124,
    "15-9-4*(-9+9)-3": 3,
    "7-7-(-6-3)": 9,
    "13*9+(9-6)+5": 125,
    "0/10*4-(-9-3)": 12,
    "3*(19+1)": 60,
    "(-1+4)*5-3*3-5": 1,
    "(-9+2)*3-(20-7)": -34,
    "1-10-15/5+8": -4,
    "8*8-16*6": -32,
    "2-9+(1+10)": 4,
    "7-5-19*6+10": -102,
    "2*3+2-7*2": -6,
    "18+4+9*8+4": 98,
    "-7*9-6+8*9": 3,
    "4-2+(3+2)*8": 42,
    "8*2-5+2*8+4": 31,
    "2+2+15*3": 49,
    "2+7-(17-7)*8": -71,
    "16*6*2-(7+10)": 175,
    "(2+7)*(12+8)": 180,
    "-10-8+40/4": -8,
    "12+8+5-9*5-6": -26,
    "-9/-10/10": 0,
    "-10+7-(10-8)+6": 1,
    "20*3-9*(-6+4)": 78,
    "15+5-9+15/3": 16,
    "0-7-4*3+10": -9,
    "12*7+(-8-5)*2": 58,
    "-5*9-8-18/2": -62,
    "-10-(11-8)": -13,
    "17+1+9*9": 99,
    "54/6+72/8*4": 45,
    "-16/4-10-(9-10)*7": -7,
    "40/5+4+50/5": 22,
    "(3-5)*-5": 10,
    "16-3-(12+1)": 0,
    "16*6+27/9+3": 102,
    "-10+10-(8-8)": 0,
    "-8*10+(-6+4)": -82,
    "-2+4-4*9+7": -27,
    "9*7-24/3*9": -9,
    "11-(10-9)*5": 6,
    "17*6-(20-5)": 87,
    "15-7+(19-1)": 26,
    "-18/3+(18+3)+6": 21,
    "20+8+(16+7)-3": 48,
    "18+3-(13+6)": 2,
    "6/2-4*(13+6)": -73,
    "(3-4)*-4*9*5": 180,
    "-21/7*(18-5)": -39,
    "15*3*8/(12-7)": 72,
    "14+1-11*5+8": -32,
    "(16+2)*7-45/5-10": 107,
    "-28/4-15*5": -82,
    "30/10-2+14*6-9": 76,
    "-3-3+4*9*5": 174,
    "8/2+9+(2-3)+7": 19,
    "-7-7-(16+7)-4": -41,
    "14*3+9-16/4-10": 37,
    "(-10-3)*6/(-7-6)*6": 36,
    "(-9-4)*4-3/3*9": -61,
    "-3-3-(17-4)": -19,
    "18+3+6-1*10*2": 7,
    "3*6-36/9*6": -6,
    "-9*7/(5+1)-2": -12,
    "(0+9)*-7*2": -126,
    "6*6+10*3*3": 126,
    "-5+5+8*(17+8)": 200,
    "-4+6-4*-20/2": 42,
    "2-4+(3-4)+5": 2,
    "3*9*6": 162,
    "(-5+10)*8/2+9": 29,
    "(13+5)*5-21/3": 83,
    "13+4+8*(-2+10)": 81,
    "16*6+3": 99,
    "7*4+8*8": 92,
    "3+3+9*48/6+5": 83,
    "-5/5-3*3": -10,
    "-3*2*3": -18,
    "17*4+8+30/10-2": 77,
    "-64/8-9-(-8-4)": -5,
    "12-3+24/4": 15,
    "3*(20+1)+4": 67,
    "16-5-(15-1)*3": -31,
    "-9/3*(4+8)*2": -72,
    "8/4-3+7*8": 55,
    "12+8+5-(4-3)": 24,
    "50/5-(3-3)": 10,
    "12/3/(10-9)": 4,
    "9+2-17*6": -91,
    "11*3+6+2*5+7": 56,
    "(-8+5)*10-(20+5)": -55,
    "2-4+4-(9-6)+5": 4,
    "-16/4-10+5*8": 26,
    "18*10+7+(-8-4)-4": 171,
    "18*7-(0-10)": 136,
    "(1+9)*7-(11-3)+4": 66,
    "-9-5+(4+1)": -9,
    "8*3+(11+4)*2": 54,
    "-2-3-(-5-5)*9": 85,
    "-10-7-16*7": -129,
    "(11-8)*(16-4)": 36,
    "16-4-14/2": 5,
    "7*6+18/6-9": 36,
    "1-9+(2+10)": 4,
    "6+1+(18-3)+5": 27,
    "18+3+6-13*3-6": -18,
    "13+1-9*6": -40,
    "(-10-3)*2+18*10+4": 158,
    "5+7+9*8+4": 88,
    "(-3+8)*(2-10)": -40,
    "18-2+(4-1)": 19,
    "-3+20*7": 137,
    "15*2*3+32/8-4": 90,
    "(-10+9)*(6-1)*3": -15,
    "7-6+2-(8-8)": 3,
    "20+9+10": 39,
    "(-1+1)*8-(16+5)": -21,
    "7*4+(-10-3)*9": -89,
    "-6-10-3+(18-2)": -3,
    "30/6-10*(6+4)-3": -98,
    "12+7+48/6+5": 32,
    "(10+2)*(4+3)-2": 82,
    "-2/2+8*6+6": 53,
    "-6*8*4+(-3+3)": -192,
    "-4-7-16/2-2": -21,
    "(7-4)*9+(12+6)+5": 50,
    "20+5+(-4+10)": 31,
    "-3*(4+7)": -33,
    "8+5-9-(-5+9)": 0,
    "32/8-4-(15-2)": -13,
    "(4+2)*-6*3": -108,
    "10*4-9+20/4-6": 30,
    "(-9+5)*2*(-10+9)": 8,
    "16/2+3+(1-7)*9": -43,
    "12*9+(-6-10)": 92,
    "-1+6-(1+10)*8": -83,
    "2*10+10-6": 24,
    "-8*3-(2-3)-8": -31,
    "-9*7-21/3": -70,
    "5*2-(16+6)+2": -10,
    "3*2-15/3": 1,
    "-5+10-5+10*6": 60,
    "(9-10)*7+42/7": -1,
    "12+1+(6+4)-3": 20,
    "-9/3*(0-10)": 30,
    "17*6+(4+2)": 108,
    "-3*9+1*4-7": -30,
    "12/3+6+27/9": 13,
    "-20/2+7*4-4": 14,
    "-8*10+9+(7-6)+2": -68,
    "-10*2-8+(4-1)": -25,
    "(-7-6)*6+50/10+2": -71,
    "2-4-5/5": -3,
    "32/8*7-7*8": -28,
    "5+(-9+9)*10": 5,
    "-7-8-(1-1)": -15,
    "80/8*9-(18+8)": 64,
    "2*5-4*2-3": -1,
    "-7*8-16": -72,
    "-2/2-3-9/9": -5,
    "19+1+(1+4)+4": 29,
    "-90/9-9+(8+5)-9": -15,
    "7*2-21/7": 11,
    "15/5+8+1*10*2": 31,
    "(-7-6)*6+5*7": -43,
    "6*6+(12+8)": 56,
    "16+6+2/-10/10": 21,
    "-9*7+6*9": -9,
    "10-2+9+(1+3)-6": 15,
    "10+9+8+16/4-6": 25,
    "17-4-1": 12,
    "-8+7-(-2-3)": 4,
    "21/7*-5*7": -105,
    "16*6*2/(-9+5)*2": -96,
    "12+9+7*(0-6)": -21,
    "1-1-5/5": -1,
    "-8*3+5/5": -23,
    "-18/9*9+(18+5)": 5,
    "20+3+5+36/6": 34,
    "-7*9-6+5": -64,
    "12/6-35/7": -3,
    "(-1-9)*(1+10)": -110,
    "17+1-(3+8)": 7,
    "21/7-3*8": -21,
    "4/4-8/2+9": 6,
    "2*6-(11-3)+5": 9,
    "70/7*(8-4)": 40,
    "16+6+2-(8-8)": 24,
    "13+6+4*3-3": 28,
    "-6*8-2-9*3*5": -185,
    "(7-4)*9-(-10-3)*6": 105,
    "-1*10*2-(16-8)+7": -21,
    "8*3+(-7+4)*3": 15,
    "9*5-2+(-9-2)": 32,
    "54/9*(18-3)+7": 97,
    "20*3-9-(-3-2)+9": 65,
    "-20/10*12/2": -12,
    "4*8+7+1*2*5": 49,
    "-5+8+9-(-3-7)+9": 31,
    "-80/8+2+25/5": -3,
    "-9-2-14*6-9": -104,
    "20*4+5-6-6": 73,
    "-7*2-49/7-2": -23,
    "10-8+6+(-7-7)": -6,
    "-4*9*5+8*8+6": -110,
    "16/4*10+(3-9)": 34,
    "-9*3*5-(0+5)": -140,
    "-3*9-(-5-10)": -12,
    "3+7+(-3-7)+9": 9,
    "15*8*10/(6-1)*3": 720,
    "11*8*6*0/3": 0,
    "(6-5)*(-7+10)*7": 21,
    "(-5-5)*9+36/4": -81,
    "0+9-10*(9-5)": -31,
    "-16/4-10-9*7": -77,
    "-7*10+(5+7)": -58,
    "16/4*10-(12+8)": 20,
    "-3-3-2*6*8": -102,
    "-4*3+10*12/3+6": 34,
    "19+4+10+24/8": 36,
    "0/9*0": 0,
    "-6+10-(5-7)": 6,
    "-9+6+4*(8+3)*9": 393,
    "7-2+(18-10)*2": 21,
    "-6+9-(3-7)": 7,
    "27/3-18*5-7": -88,
    "15*2*3+48/8": 96,
    "-5*8*(3-5)": 80,
    "17+1-(5-7)*6": 30,
    "-3-3+10-(9-10)": 5,
    "5+2+15*7-2": 110,
    "-4*2*8-14*5": -134,
    "-10*2-7+(15+4)": -8,
    "11-18/3": 5,
    "5+1-2+8*10+7": 91,
    "19-4+7-25/5+5": 22,
    "14/2-17*9": -146,
    "-5+10-5-(0-1)-4": -3,
    "70/10*-3*8": -168,
    "48/6+5+16": 29,
    "20+9+5-8*8": -30,
    "2+10+(3+10)": 25,
    "-6-1+19*9": 164,
    "-8*3-(-4-7)": -13,
    "18-2+8/2+9": 29,
    "-5*8*3-48/8+10": -116,
    "14-7-2*3-6": -5,
    "2*3+2/(9-5)+4": 10,
    "-6+9-(3+10)": -10,
    "-4-8-10+4*9*5": 158,
    "7*2-8*(-2+4)": -2,
    "3+10+10/5": 15,
    "11*3+6+(6+8)": 53,
    "8+9+10/10": 18,
    "13+2+(14-7)*3": 36,
    "19-4+7*(8+5)-9": 97,
    "-10+8+(0+9)": 7,
    "19*7+9+(0-6)": 136,
    "-8-8+(6+4)": -6,
    "18+8-(14+9)-4": -1,
    "1-6+4*-5/5": -9,
    "(1-7)*9-(7-7)": -54,
    "-7-8-8+(18-3)+5": -3,
    "10+6+5+(12+7)": 40,
    "63/7-(-8+7)": 10,
    "12+9+7+30/3": 38,
    "-4*2*8-(13+6)": -83,
    "14-6+(13+4)+8": 33,
    "6*5*8-9*6": 186,
    "(-6+2)*-21/7": 12,
    "20-5+63/9-5": 17,
    "54/6-(9-10)*7": 16,
    "-8*3+56/7": -16,
    "20+3+5+14*6-9": 103,
    "-63/9-5-(16+6)+2": -32,
    "(8+9)*7": 119,
    "49/7-2+10*3*3": 95,
    "-56/7+(11+8)": 11,
    "15-4-9+50/5": 12,
    "19+8-(10+1)": 16,
    "-49/7*6-(-7-8)-8": -35,
    "10+2-(20+5)": -13,
    "72/8-9-2/2": -1,
    "20-1-10+54/9": 15,
    "-8-4-4+(16+5)": 5,
    "-4*8-(15+6)": -53,
    "-4+6-4-8*8+6": -60,
    "20+1+4+(4+10)": 39,
    "-6*9+2*8*4": 10,
    "27/3-3*3": 0,
    "15*6+4*8+7": 129,
    "10+9+8-(16+10)": 1,
    "0*4-5*-21/3": 35,
    "(-7+10)*7-12/3+6": 23,
    "16-3-8+1+9": 15,
    "6+3*(-10+8)*4": -18,
    "18": 18,
    "(-9+5)*2/-2": 4,
    "-6-6-8*-7+6": 50,
    "(-10-3)*9-4*3-3": -132,
    "28/7+10+16/4-10": 8,
    "13*8-(16+3)": 85,
    "20-1-10+3-8": 4,
    "-1-9-(-2-10)-10": -8,
    "-7*8-(3+6)": -65,
    "20*4+24/4": 86,
    "12+8+(19+5)": 44,
    "13-6-(-5-3)-7": 8,
    "-5*5*-80/8+2": 252,
    "-5+7+(14+9)-4": 21,
    "(7-7)*(-5-6)-6": -6,
    "-9-8": -17,
    "(-7-7)*12/3+6": -50,
    "(-4+9)*7+5*5": 60,
    "-3*7*5-(0+10)*4": -145,
    "-8-8-10*10": -116,
    "19*7+9-11*5+8": 95,
    "-16/4-10*-35/7": 46,
    "13+6+5*10": 69,
    "-21/7/(0+3)": -1,
    "13*2-(-6+2)": 30,
    "(10-9)*5*(8+5)-9": 56,
    "10*10+(-2+10)": 108,
    "(-6+4)*3": -6,
    "(0+5)*5+8": 33,
    "6+6/10*4": 8,
    "(-7+10)*7+(10+1)": 32,
    "(4-6)*-18/3-7": 5,
    "(-3-3)*(-10-7)": 102,
    "-7*10-36/9*9": -106,
    "8*8*5": 320,
    "(1+10)*8-4*10-5": 43,
    "15*4-(5+7)": 48,
    "-2*-3+9": 15,
    "(3+2)*8-(-4+9)*7": 5,
    "-3+9+6-(-9+6)": 15,
    "17*9/(-8-9)": -9,
    "-4+2+17*6": 100,
    "2-9/14/2": 1,
    "18-5/3": 16,
    "19-3-9-28/7-5": -2,
    "16+8-8*(17-1)-9": -113,
    "-7+3-8/4": -6,
    "4*8+7+(-3-3)+10": 43,
    "(14-6)/(15-9)-4": -2,
    "(3+4)*(19+4)": 161,
    "16+(-4+9)*7": 51,
    "(-10-3)*2+19*8": 126,
    "-5*8+28/7-5": -41,
    "-8-9+3*-18/3": -35,
    "11*9-3*6-3": 78,
    "(-4-1)*(11+8)": -95,
    "-1*5+9*-45/9*4": -185,
    "19*6-4+(1+10)*8": 198,
    "(18-10)*2-18*10+7": -157,
    "60/10+(-10-6)": -10,
    "-6+2+(10-7)": -1,
    "15+2+2*(0+9)-10": 25,
    "27/9+3+70/10": 13,
    "(-6+4)*10+(-5+9)": -16,
    "-10-6+(-2+7)": -11,
    "(-9+2)*3*(11-8)": -63,
    "(-9-4)*10-28/7-5": -139,
    "9-6+5-30/5*6": -28
  }
}

